[
  {
    "basicInfo": {
      "name": "Aussie Chicken",
      "difficulty": 3,
      "duration": "25 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Seasoned Salt No MSG UNI-LA"
      },
      {
        "name": "Cured Bacon-Pan Fried"
      },
      {
        "name": "Dehyd Onion Flakes"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "Monterey Jack Cheese-Shredded"
      },
      {
        "name": "Colby Cheese-Shredded"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Sauce, Aussie chicken"
      }
    ],
    "steps": [
      {
        "text": "Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes."
      },
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside."
      },
      {
        "text": "Make Aussie Chicken Sauce."
      },
      {
        "text": "Heat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese."
      },
      {
        "text": "Bake in preheated over for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Bangers & Mash",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Peeled Potato Ckd w/Salt Lrg-3\" to 4.25\""
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "3.25% Whole Milk"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Beef Sausage-Ckd f/Fresh"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Brown Gravy-Dry Mix"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Preheat the oven to 350 degrees F (175 C). Peel and quarter potatoes, place them in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 20 minutes. Drain, and mash with 1 teaspoon of the butter, and enough milk to reach your desired creaminess. Continue mashing, or beat with an electric mixer, until smooth. Season with salt and pepper to taste."
      },
      {
        "text": "In a large skillet over medium heat, cook the sausage until heated through. Remove from pan, and set aside. Add remaining teaspoon of butter to the skillet, and fry the diced onions. Simmer, stirring constantly, to form a thick gravy."
      },
      {
        "text": "Pour half of the gravy into a square casserole dish so that it coats the bottom. Place sausages in a layer over the gravy (you can butterfly the sausages if you wish). Pour remaining gravy over them, then top with mashed potatoes."
      },
      {
        "text": "Bake uncovered for 20 minutes in the preheated oven, or until potatoes are evenly brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Curry",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4 Cups - 32"
    },
    "ingredients": [
      {
        "name": "Peanut Salad/Cooking Oil"
      },
      {
        "name": "Margarine SoyCorn-Hydrog"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Ground Coriander AST"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Ground Turmeric"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      },
      {
        "name": "Fresh Serrano Peppers"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Plain Whole Milk Yogurt w/8gProt Per Cup"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Heat oil and margarine in a small skillet or wok over medium high heat. Add chopped onion and saute until very brown, 10 to 15 minutes. (Note: This is an important step; if onion is not cooked well, sauce will taste funny.)"
      },
      {
        "text": "Add minced ginger and garlic to onion and saute for an additional 2 minutes. Process onion/ginger/garlic mixture in food processor until smooth. Do not rinse food processor."
      },
      {
        "text": "Place onion mixture in large saucepan. Stir in the cinnamon, black pepper, coriander, cumin, turmeric and cayenne pepper and cook over low heat until mixture is thick and has the consistency of a paste."
      },
      {
        "text": "Puree tomatoes, chile peppers and cilantro in food processor until smooth. Add to onion mixture and stir well over low heat, cooking off moisture from tomatoes and cilantro. Add yogurt a little bit at a time, stirring constantly to avoid curdling."
      },
      {
        "text": "Blend the whole mixture in food processor to puree it (for a very smooth sauce). Return to saucepan, add water and increase heat to high; bring to a rolling boil. Cover saucepan and boil for 3 to 5 minutes. Reduce heat and simmer until desired consistency is reached."
      },
      {
        "text": "To serve with meat, cook the meat first separately, then simmer for 5 to 10 minutes in the sauce before serving over rice or with bread. To serve with vegetables, steam raw veggies first for 4 to 5 minutes, then simmer for 5 to 10 minutes in the sauce before serving"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef Bourguignon",
      "difficulty": 3,
      "duration": "3 Hours",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Burgundy Red Wine-5 fl oz Svg"
      },
      {
        "name": "Brandy-80 Proof"
      },
      {
        "name": "Fresh White Onions Medium Whole-2 1/2\""
      },
      {
        "name": "Fresh Carrots-Med"
      },
      {
        "name": "Fresh Parsley Sprigs"
      },
      {
        "name": "Dried Crumbled Bay Leaves"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Ground Pink Peppercorns AST"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Beef Chuck Clod Roast Choice 1/4\"Tr-Rstd"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Cured Pork Bacon Cooked-Med Slc"
      },
      {
        "name": "Fresh White Onions Medium Whole-2 1/2\""
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Beef Bouillon-14.5oz rts Can"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Fresh Mushrooms-Med"
      }
    ],
    "steps": [
      {
        "text": "For Marinade: In a large bowl, combine the wine, brandy, onions. carrots, parsley, one whole bay leaf, garlic, peppercorns and salt. Mix well and add the 2 pounds raw cubed beef. Cover and marinate in the refrigerator for 2 days."
      },
      {
        "text": "Preheat oven to 300 degrees F (150 degrees C)."
      },
      {
        "text": "For Bourguignon: Strain the meat from the vegetables and marinade; reserve marinade. Dry meat with paper towels. Heat 2 tablespoons of the oil in a large skillet over medium high heat. Add the meat and saute for 10 minutes, or until browned on all sides. Transfer meat to a separate medium bowl with a slotted spoon and set aside."
      },
      {
        "text": "In the same skillet, add the bacon and saute until lightly browned. Transfer the bacon to the bowl with the meat. Drain the skillet and return it to the heat. Pour a cup of the marinade into the skillet to deglaze the skillet, scraping the bottom to loosen up all the little bits. Return this liquid to the reserved marinade."
      },
      {
        "text": "Heat the remaining oil in the skillet. Add the onion and carrot from the marinade, along with the additional onion that you've chopped, and saute for 5 minutes, or until tender. Transfer this mixture to the bowl and the meat and bacon, again using a slotted spoon, and return skillet to the heat. Add the flour to the skillet, combining with the oil and stir until well mixed and brown, about 2 minutes."
      },
      {
        "text": "Now add the tomato paste, garlic, beef broth, reserved marinade and salt and pepper to taste. Bring to a boil and whisk to remove any flour lumps. Add this to the meat and vegetable mixture. Place entire mixture into a 9x13 baking dish."
      },
      {
        "text": "Bake at 300 degrees F (150 degrees C) for 3 hours, stirring occasionally and adding water as needed. Season with salt and pepper to taste."
      },
      {
        "text": "About 15 minutes before meat is done baking, melt butter in the skillet over medium high heat. Add the sliced muchrooms and saute 5 to 10 minutes, or until lightly browned. When meat is done, add the mushrooms to the meat mixture, stir well and let sit for about 15 minutes.\r\n\r\nServe with potatoes, noodles or"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef Teriyaki",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Glutinous White Rice-Ckd"
      },
      {
        "name": "Beef Top Sirloin Stk Chc 1/8\"Tr-PanFrd"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Beef Broth/Bouillon-14oz rts Can"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Garlic Powder"
      },
      {
        "name": "Fresh Broccoli Florets"
      }
    ],
    "steps": [
      {
        "text": "In a saucepan bring 1 2/3 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes."
      },
      {
        "text": "Meanwhile, slice beef into very thin strips."
      },
      {
        "text": "In a mixing bowl, combine the cornstarch, broth, soy sauce, sugar and garlic powder. Mix thoroughly."
      },
      {
        "text": "In a large skillet, over medium/high heat, saute the beef strips until browned and juices evaporate."
      },
      {
        "text": "Stir broccoli and cornstarch mixture into meat. Cook until mixture boil and thickens, stirring frequently. Serve over the cooked rice.\r\n\r\nCopyrighrt @ 2005\r\nwww.allrecipes.com\r\n\r\nRecipe submitted by: Corwynn Darkh"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Bierock Casserole",
      "difficulty": 3,
      "duration": "25 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Beef Ground Hamburger 10%Fat-Pan Browned"
      },
      {
        "name": "Sauerkraut Canned-w/Liquid"
      },
      {
        "name": "Higher Fat Plain Biscuit-Refrig Dough"
      },
      {
        "name": "Cheddar Cheese-Shredded"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Brown onion and 1 1/2 lb raw ground beef in a large skillet over medium high heat; drain extra fat out of skillet, then stir in drained sauerkraut. Heat through and set aside."
      },
      {
        "text": "Press 1 package (8 oz) of crescent roll dough into the botton of a lightly greased 9x13 inch baking dish. Spread beef mixture on top, then lay 2nd package of crescent roll dough over the top of the beef mixture. Press dough seams together and sprinkle all with cheese."
      },
      {
        "text": "Bake in preheated oven for 25 to 30 minutes, or until golden brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Braised Tofu",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Firm Tofu w/Calcium Sulfate-Block"
      },
      {
        "name": "Sesame Salad/Cooking Oil"
      },
      {
        "name": "Chinese Waterchestnut Slices w/Liq-Cnd"
      },
      {
        "name": "Shiitake Mushrooms Pieces-Ckd"
      },
      {
        "name": "Steamed Snow Pea Pods-10 Each = 27g"
      },
      {
        "name": "Oyster Flavored Sauce CBT"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Slice tofu block into 3 long slabs lengthwise. Wrap each slab in paper towels, and press to squeeze out excess water."
      },
      {
        "text": "Coat a large skillet with cooking spray, and then add 2 teaspoons of the sesame oil. Once the oil is hot, add the tofu slabs to the skillet. Fry for about 5 minutes on each side, or until delicately browned."
      },
      {
        "text": "Remove tofu from skillet, and slice into cubes. Add the remaining teaspoon of sesame oil to the skillet, and stir fry the drained water chestnuts, mushrooms and snow peas. Mix together water and oyster sauce, and add to the skillet along with the tofu. Cover, and cook over low heat for about 10 minutes.\r\n\r\nNOTE: Vegetarians may use mushroom based oyster flavored sauce to make this recipe!\r\n\r\nCopyright @ 2005\r\nwww.allrecipes.com\r\n\r\nRecipe submitted by: Melissa"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Broccoli Beef",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Beef Broth-Cnd DLM-CI"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Beef Top Round Steak Choice 1/4\"Trim-Frd"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Broccoli Chopped Cooked-Drnd"
      }
    ],
    "steps": [
      {
        "text": "In a small bowl, combine flour, broth, sugar, and soy sauce. Stir until sugar and flour are dissolved."
      },
      {
        "text": "In large skillet or wok over high heat, cook and stir beef (cut into bite size pieces) 2 to 4 minutes, or until browned. Stir in broth mixture, chopped ginger, minced garlic, \r\nand broccoli. Bring to a boil, then reduce heat. Simmer 5 to 10 minutes, or until sauce thickens.\r\n\r\nNote: Serve over hot rice or noo"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Bruschetta",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Fresh Red Tomatoes Year Round Avg Lrg-3\""
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Fresh Chives"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Basil-Chopped"
      },
      {
        "name": "Extra Virgin Olive Oil NOI"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "In a medium bowl combine tomatoes (seeded and chopped), parsley, chopped chives, minced garlic, minced basil, olive oil, and salt and pepper to taste. Cover and refrigerate for at least 1 hour, allowing flavors to meld before serving.\r\n\r\nNOTE: This makes a great appetizer or a light meal f"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Curry",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Fresh Shallots-Chpd"
      },
      {
        "name": "Chicken Broil/Fry Whl w/oSkin-Stwd"
      },
      {
        "name": "Curry Sauce-Prep f/Recipe"
      },
      {
        "name": "Curry Powder"
      },
      {
        "name": "Coconut Milk-Canned"
      },
      {
        "name": "Tomato Puree-Cnd"
      },
      {
        "name": "Fish Sauce-rts"
      },
      {
        "name": "Fresh Sugar Palm Fruit INTL"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      },
      {
        "name": "Fresh Cilantro-Leaves"
      }
    ],
    "steps": [
      {
        "text": "Heat the  oil in a medium skillet over low heat, and stir fry the thinly sliced shallots until browned and tender. Drain, reserving the oil, and set aside."
      },
      {
        "text": "Place the chicken (cut into large pieces) in the reserved oil, and stir in the curry paste and curry powder to evenly coat. Pour in enough water to cover, and bring to a boil. Reduce heat, cover skillet, and simmer until the chicken is no longer pink and juices run clear."
      },
      {
        "text": "Stir in the coconut milk, tomato puree, fish sauce, palm sugar (1 tbs = 12 g), and 1/2 of the tomatoes (cut in wedges) into the skillet. Cook and stir over low heat until the mixture is smooth and creamy. Mix in the remaining tomato wedges, and continue cooking until tender. Top with the chopped cilantro and the fried shallots to serve.\r\n\r\nNOTE: This recipe is good with steamed jasmine rice. It's quite a hot and spicy dish, so if you want it a bit mild, check the curry paste you use first. You can replace coconut milk with evaporated milk, but traditionally, coconut milk is a"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Cantonese Barbecued",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Sherry Cooking Wine BGF-RE"
      },
      {
        "name": "Fresh Ginger Root Slices"
      },
      {
        "name": "Oyster Sauce-rts"
      },
      {
        "name": "Chinese Five Spice-Pwd INTL"
      },
      {
        "name": "Tamari Soy Sauce"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Hoisin Sauce-rts"
      },
      {
        "name": "Ketchup"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Pork Roast Blade Loin-Rstd"
      },
      {
        "name": "Honey"
      }
    ],
    "steps": [
      {
        "text": "In bowl, sir together dry sherry, sliced ginger root, oyster sauce, five-spice powder, soy sauce, white sugar, hoisin sauce, ketchup and cinnamon."
      },
      {
        "text": "Cut pork into 5x2 inch strips. Place strips flat in a shallow baking dish. Pour marinade over pork strips. Let pork marinate at least 6 hours in refrigerator."
      },
      {
        "text": "Drain, reserving marinade. Mix honey and 3 tablespoons reserved marinade in a small bowl; set aside. Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Fill a shallow roasting pan with water and place in botton of oven. Carefully place pork strips on a roasting rack above roasting pan so all sides are exposed to heat. If you don't have a roasting rack, insert the curved end of an S-shaped hook, paper clip, or drapery hook in pork strips and hang them from the top shelf."
      },
      {
        "text": "Roast for 30 minutes. Baste pork strips with honey mixture. Roast 15 minutes and baste again. Roast 10 minutes longer or until pork strips are crisp and golden brown. Remove from oven and let cool.\r\n\r\nNOTE 1: Serve at room temperature arranged in overlapping layers on a platter. Granish with cucumber slices, if desired.\r\n\r\nNOTE 2: Hoisin sauce, also called Peking sauce, is a thick, reddish-brown sauce that is sweet and spicy, and widely used in Chinese cooking. It's a mixture of soybeans, garlic, chile peppers and various spices. It can be found in Asian markets and many large supermarkets. Look in the Asian or ethnic section. If this item is not in stock at your local store, ask your grocer to special order it for you. Most grocers will be happy to do this for their custo"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Carne Con Papas",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Fresh Sweet Green Bell Pepper-Med"
      },
      {
        "name": "Fresh White Onions Small-Whole"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Beef Shank Crosscut All Lean 1/4\"Trm-Raw"
      },
      {
        "name": "Peeled Potato Cooked-1.75\" to 2.5\""
      },
      {
        "name": "Medium White Wine-5 fl oz Svg"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "Beef Broth Cube"
      }
    ],
    "steps": [
      {
        "text": "In a blender, combine green pepper (seeded and chopped), chopped onion, crushed garlic, 1/4 teaspoon cumin and salt. Pulse, while pouring 1/8 cup olive oil through top of blender. Blend until smooth; set aside."
      },
      {
        "text": "Heat 1 tablespoon olive oil in pressure cooker on medium heat. Saute green pepper mixture for 1 minute, then stir in 2 tablespoons achiote powder and 1 teaspoon cumin. Cook for 1 minute, then stir in tomato sauce. Return to a simmer, then add beef (cut into 1 inch cubes); let simmer for 5 minutes. Stir in potatoes, then pour in wine and water. Drop in the bouillon cubes. Bring to a boil, and cook for 1 minute; add water, if necessary, to cover."
      },
      {
        "text": "Cover with lid of pressure cooker. Following manufacturer's directions, cook under 15 pound pressure for about 30 to 45 minutes"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Cashew",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Chicken Broil/Fry Whl w/oSkin Chpd-Rstd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Chopped Celery-Steamed"
      },
      {
        "name": "Bamboo Shoots Canned-Svg CON-HL"
      },
      {
        "name": "Chinese Waterchestnut Slices w/Liq-Cnd"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Water"
      },
      {
        "name": "Dry Roasted Cashews-Unsalted"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large skillet over medium high heat. Saute chicken until it turns white, then season with salt and pepper and add broth, soy sauce, chopped celery, drained and diced bamboo shoots, and drained and diced water chestnuts. Cover skillet, reduce heat to low and simmer for 5 minutes."
      },
      {
        "text": "Beat cornstarch in cold water together in a small bowl, then blend into skillet mixture and heat through until thick and bubbly. Sprinkle with cashews and serve"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chalau",
      "difficulty": 3,
      "duration": "2 Hrs",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Lamb Composite Choice 1/8\" Trim-Cooked"
      },
      {
        "name": "Water"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Spinach Cooked-Drnd"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Enrich Long Grain White Rice-Ckd"
      }
    ],
    "steps": [
      {
        "text": "Heat 1/2 cup of oil in large heavy skillet over medium-low heat. Add finely chopped onion, and fry gently until transparent. Increase heat to medium, and add minced garlic and cubed stew meat. Cook, stirring frequently, until meat is browned on the outside. Pour in the water (1 1/2 cups), and season with salt, pepper, cayenne pepper to taste, and cumin. Bring to simmer, and reduce heat to low. Cover the pan, and continue cooking for 1 1/2 to 2 hours."
      },
      {
        "text": "Heat 1/4 cup of oil in a large saucepan over medium-high heat. Add rice, and cook, stirring frequently for 5 minutes. Add 6 cups water, and bring to a boil. Reduce heat to low, and cook loosely covered for about 30 minutes, or until rice is tender."
      },
      {
        "text": "Add chopped spinach and cilanto to the meat mixture, and cook for another 10 to 15 minutes. Mound the rice on a platter, and spoon some of the lamb stew over. Put remaining stew in a separate serving bowl"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Cordon Bleu",
      "difficulty": 3,
      "duration": "35 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Swiss Cheese-Slc"
      },
      {
        "name": "11% Fat Ham Lunchmeat Slc-6.25\"x4\"x1/16\""
      },
      {
        "name": "Seasoned Bread Crumbs-Dry Grated"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11 inch baking dish with nonstick cooking spray."
      },
      {
        "text": "Pound chicken breasts to 1/4 inch thickness."
      },
      {
        "text": "Sprinkle each piece of chicken on both sides with salt and pepper. Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick. Place in baking dish, and sprinkle chicken evenly with bread crumbs."
      },
      {
        "text": "Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast. Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Lo Mein",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Natural Rice Vinegar NAK"
      },
      {
        "name": "Tamari Soy Sauce"
      },
      {
        "name": "Chicken Broth-rts Can"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "Sesame Salad/Cooking Oil"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Enrich Spaghetti Pasta-Ckd"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Shiitake Mushrooms Pieces-Ckd"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Lrg"
      }
    ],
    "steps": [
      {
        "text": "In a medium, non-reactive bowl, combine the chicken with 2 1/2 teaspoons of the white sugar, 1 1/2 tablespoons vinegar and 1/4 cup soy sauce. Mix this together and coat the chicken well. Cover and let marinate in the refrigerator for at least 1 hour."
      },
      {
        "text": "In another medium bowl, combine the chicken broth, water, sesame oil and ground black pepper with the remaining sugar, vinegar and soy sauce. In a separate small bowl, dissolve the cornstarch with some of this mixture and slowly add to the bulk of the mixture, stirring well. Set aside."
      },
      {
        "text": "Cook the linguine pasta according to package directions, drain and set aside. Heat 1 tablespoon of the oil in a wok or large saucepan over high heat until it starts to smoke. Add the chicken and stir-fry for 4 to 5 minutes, or until browned. Transfer this and all juices to a warm plate."
      },
      {
        "text": "Heat the remaining oil in the wok or pan over high heat. Add the ginger, garlic, mushrooms and sliced green onions, and stir-fry for 30 seconds. Add the reserved sauce mixture and then the chicken. Simmer until the sauce begins to thicken, about 2 minutes. Add the reserved noodles and toss gently, coating everything well with the sauce.\r\n\r\nGarnish with chopped fresh cilantro.\r\n\r\nNOTE: The nutrition data for this recipe includes information for the full amount of the marinade ingredients. Depending on marinating time, ingredients, cooking method, etc., the actual amount of the marinade consumed will"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Schwarma",
      "difficulty": 3,
      "duration": "40 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Ale Malt Vinegar-Tbsp DLM-SI"
      },
      {
        "name": "Plain Whole Milk Yogurt w/8gProt-8ozCntr"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Ground Cardamom"
      },
      {
        "name": "Chicken Broil/Fry Thigh w/oSkin-Rstd"
      },
      {
        "name": "Tahini f/Raw & Stone Ground Kernels"
      },
      {
        "name": "Plain Whole Milk Yogurt w/8gProt-8ozCntr"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Lemon Juice"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      },
      {
        "name": "Fresh Sliced White Onions"
      },
      {
        "name": "Fresh Green Leaf Lettuce-Shredded"
      },
      {
        "name": "Unenrich White Pita Bread-6 1/2\""
      }
    ],
    "steps": [
      {
        "text": "In a glass dish, mix together the malt vinegar, 1/4 cup yogurt, oil, 1 tsp mixed spice, cardamom, salt and pepper. Place the chicken thighs into the mixture and turn to coat. Cover and marinate in the refrigerator for at least 4 hours or overnight."
      },
      {
        "text": "Preheat the oven to 350 degrees F (175 degrees C). In a small bowl, mix together the tahini, 1/4 cup yogurt, garlic, lemon juice, oilve oil, and parsley. Season with salt and pepper, taste, and adjust flavors if desired. Cover and refrigerate."
      },
      {
        "text": "Cover the chicken and bake in the marinade for 30 minutes, turning once. Uncover, and cook for an additional 5 to 10 minutes, or until chicken is browned and cooked through. Remove from the dish, and cut into slices."
      },
      {
        "text": "Place sliced chicken, tomato, onion, and lettuce onto pita breads. Roll up, and top with the tahini sauce"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Barbecued Spareribs",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Hoisin Sauce-rts"
      },
      {
        "name": "Cranberry Sauce Swtnd Cnd-1/2\" Slc"
      },
      {
        "name": "LowSodium Soy Sauce f/Wheat & Soy"
      },
      {
        "name": "Medium White Wine-5 fl oz Svg"
      },
      {
        "name": "Honey"
      },
      {
        "name": "Garlic Salt MCC"
      },
      {
        "name": "Chinese Five Spice-Pwd INTL"
      },
      {
        "name": "Pork Spareribs-Brsd"
      }
    ],
    "steps": [
      {
        "text": "In a large bowl, blend hoisin sauce, cranberry sauce, soy sauce, white wine, honey, and 1/2 tsp red food coloring. Mix in garlic salt and Chinese five-spice powder. Place 4 lb raw  ribs in the mixture. Cover and marinate in the refrigerator at least 1 hour."
      },
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Place 2 cups water in bottom of a large roasting pan. Arrange ribs on pan rack, and cook 30 minutes in the preheated oven. Cover with remaining sauce mixture, and continue cooking 30 minutes, to an internal temperature of 160 degrees F (70 degrees C).\r\n\r\nNOTE: Hoisin sauce, also called Peking sauce, is a thick, reddish-brown sauce that is sweet and spicy, and widely used in Chinese cooking. It's a mixture of soybeans, garlic, chile peppers and various spices. It can be found in Asian markets and many large supermarkets. Look in the Asian or ethnic section. If this item is not in stock at your local store, ask your grocer to special order it for you. Most grocers will be happy to do this for their custo"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chop Suey",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Household Shortening"
      },
      {
        "name": "Pork Whole Loin-Rstd"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Chopped Celery-Steamed"
      },
      {
        "name": "Water"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Bean Sprouts Canned-Svg CON-HL"
      },
      {
        "name": "Water"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "White Granulated Sugar"
      }
    ],
    "steps": [
      {
        "text": "Heat shortening in a large, deep skillet. Sear diced pork until it turns white, then add onion and saute for 5 minutes. Add celery, hot water, salt and pepper. Cover skillet and simmer for 5 minutes. Add drained, rinsed bean sprouts and heat to boiling."
      },
      {
        "text": "In a small bowl combine the cold water, cornstarch, soy sauce and sugar. Mix together and add to skillet mixture. Cook for 5 minutes, or until thickened to taste.\r\n\r\nServe over hot rice, topped with chow mein noodles and soy sauce, if desired.\r\n\r\nNOTE: You can substitute a can of Chinese mixed vegetables for the bean sprouts if you like more color and tex"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Seafood Cioppino",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "12 - 14"
    },
    "ingredients": [
      {
        "name": "Salted Butter"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Stewed Tomatoes w/Liquid-Cnd"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Ground Basil"
      },
      {
        "name": "Ground Thyme"
      },
      {
        "name": "Oregano-Ground"
      },
      {
        "name": "Water"
      },
      {
        "name": "Medium White Wine"
      },
      {
        "name": "Mixed Species Shrimp Large-Stmd"
      },
      {
        "name": "Steamed Scallops"
      },
      {
        "name": "Mixed Species Clams Small-Stmd"
      },
      {
        "name": "Fresh Blue Mussels-Med"
      },
      {
        "name": "Blue Crab Flaked Pieces-Stmd"
      },
      {
        "name": "Cod Fish-Steamed/Poached SVY"
      }
    ],
    "steps": [
      {
        "text": "Over medium-low heat, melt butter in a large stockpot, add chopped onions, minced garlic, and chopped parsley. Cook slowly, stirring occasionally until onions are soft."
      },
      {
        "text": "Add tomatoes to the pot (break them into chunks as you add them). Add chicken broth, 2 bay leaves, basil, thyme, oregano, water and wine. Mix well. Cover and simer 30 minutes."
      },
      {
        "text": "Stir in 1 1/2 lb raw, peeled and deveined shrimp, 1 1/2 lb raw scallops, clams, cleaned and debearded mussels, and crabmeat. Stir in 1 1/2 lb raw cubed fish, if desired. Bring to boil. Lower heat, cover and simmer 5 to 7 minutes until clams open. Ladle soup into bowls and serve with warm, crusty bread!\r\n\r\nCopyright @ 2005\r\nwww.allrecipes.com\r\n\r\nRecipe submitted by: Star Po"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Minestrone",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Leeks Cooked-Drnd"
      },
      {
        "name": "Whole Carrots Cooked-Drnd"
      },
      {
        "name": "Zucchini Squash Slices w/Skin Ckd-Drnd"
      },
      {
        "name": "Green Snap Beans Ckd-Drained"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Vegetable Broth-Cnd CAM-SW"
      },
      {
        "name": "Fresh Red Tomatoes YearRoundAvg-Chpd/Slc"
      },
      {
        "name": "Fresh Thyme"
      },
      {
        "name": "Cannellini Beans-Cnd GML-PR"
      },
      {
        "name": "Semolina Elbow Macaroni Pasta-Dry APC-GG"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Heat olive oil in a large saucepan, over medium heat. Add sliced leek, chopped carrots, one thinly sliced zucchini, green beans cut into 1 inch pieces, and celery. Cover, and reduce heat to low. Cook for 15 minutes, shaking the pan occasionally."
      },
      {
        "text": "Stir in the stock, chopped tomatoes, and chopped thyme. Bring to a boil, then replace the lid, and reduce heat to low; simmer gently for 30 minutes."
      },
      {
        "text": "Stir in the cannellini beans with liquid and pasta. Simmer for an additional 10 minutes, or until pasta is al dente. Season with salt and pepper to taste before serving.\r\n\r\nServe with parmesan cheese and chopped fresh par"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Yorkshire Pudding",
      "difficulty": 3,
      "duration": "35 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "3.25% Whole Milk"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Beef Drippings"
      }
    ],
    "steps": [
      {
        "text": "In a large bowl, mix together the flour, milk, eggs and salt. Using an electric mixer, beat 5 minutes, until smooth. Cover and refrigerate 1 hour."
      },
      {
        "text": "Preheat oven to 425 degrees F (200 degrees C). Coat a 9x13 inch baking pan with beef or bacon drippings. Preheat the pan 15 minutes so the drippings are hot and sizzling."
      },
      {
        "text": "Remove the mixture from the refrigerator. Beat briefly, then scoop into the baking pan. Bake 20 minutes."
      },
      {
        "text": "Lower oven temperature to 375 degrees F (190 degrees C). Without opening the oven, continue baking 15 minutes. The mixture should be puffed and golden brown. Remove from oven and serve hot"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Bean & Rice",
      "difficulty": 3,
      "duration": "50 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Fresh Sweet Green Bell Pepper-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Mature Red Kidney Beans-Cnd"
      },
      {
        "name": "Enrich Long Grain White Rice-Ckd"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large saucepan over medium heat. Saute chopped onion, chopped bell pepper, and minced garlic. When onion is translucent add salt and tomato paste. Reduce heat to low and cook 2 minutes. Stir in beans and rice."
      },
      {
        "text": "Pour liquid from the beans into a large measuring cup and add enough water to reach a volume of 2 1/2 cups; pour into beans. Cover and cook on low for 45 to 50 minutes, or until liquid is absorbed and rice is cooked"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Black",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Mature Black Beans-Ckd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Sweet Red Bell Peppers-Med"
      },
      {
        "name": "Fresh Sweet Green Bell Pepper-Med"
      },
      {
        "name": "Ground Paprika AST"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Oregano-Ground"
      },
      {
        "name": "Fresh Whole Hot Green Chile Peppers"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Balsamic Vinegar HCG-HF"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Wash beans. In a large bowl, soak beans in water to cover overnight."
      },
      {
        "text": "Rinse beans, and transfer to a large stock pot. Add chopped onion, chopped peppers, 2 bay leaves, paprika, cumin, oregano, and minced chile peppers, along with water to cover. Bring to a boil, reduce heat, and simmer for 1 1/2 hours."
      },
      {
        "text": "Test beans for tenderness, and when tender add minced garlic and balsamic vinegar. Salt and pepper to taste.\r\n\r\nServe these flavorful beans over rice, as a sauce for pasta or with a good loaf of b"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Midnight Medianoche",
      "difficulty": 3,
      "duration": "5 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Mayonnaise w/Soybean Oil"
      },
      {
        "name": "Italian Dressing UNI-CO"
      },
      {
        "name": "Classic Deli Soft Hoagie Rolls CAM-PF"
      },
      {
        "name": "Yellow Mustard-Prep"
      },
      {
        "name": "Deli OvenRstd TurkyBrst Lunchmeat CON-HC"
      },
      {
        "name": "Deli Honey Ham Lunchmeat-Slc CON-HC"
      },
      {
        "name": "Swiss Cheese-Slc"
      },
      {
        "name": "Dill Pickles Slices"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      }
    ],
    "steps": [
      {
        "text": "Split hoagie rolls lengthwise. In a small bowl, mix together mayonnaise and Italian dressing. Spread mixture on hoagie rolls. Spread each roll with mustard. On each roll arrange layers of turkey, ham, and cheese. Top each with dill pickle slices. Close sandwiches, and brush tops and bottoms with olive oil."
      },
      {
        "text": "Heat a non-stick skillet over medium-high heat. Place sandwiches in skillet. Cook sandwiches for 2 minutes, pressing down with a plate covered with aluminum foil. Flip, and cook for 2 more minutes, or until cheese is melted. Remove from heat, place on plates, and cut in half diagonally"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Dolmathes",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "6 - 8"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Enrich Long Grain White Rice-Ckd"
      },
      {
        "name": "Fresh Lemon Juice-Yield Per Fruit"
      },
      {
        "name": "Fresh Dill Weed Sprigs"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Dried Pignolia Pine Nuts"
      },
      {
        "name": "Grape Leaves-Cnd"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 375 degrees F (190 degrees C)."
      },
      {
        "text": "Heat 2 tablespoons oil in a large saucepan over medium heat. Saute onions until tender. Stir in rice and brown slightly. Add 3 1/2 cups water, and half of the lemon juice from the juiced lemons. Reduce heat, cover and simmer for 20 minutes, or until all liquid is absorbed and rice is tender. Stir in  chopped dill and parsley and pine nuts."
      },
      {
        "text": "Remove stems from grape leaves and place 1 tablespoon of rice mixture in the center. Fold in the sides and roll tightly. Place, folded side down, in a baking dish and cover with remaining olive oil, lemon juice and enough water to cover 1/2 of the dolmathas."
      },
      {
        "text": "Cover with aluminum foil and bake in preheated oven for 45 minutes"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Coq Au Vin",
      "difficulty": 3,
      "duration": "35 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Chicken Broil/Fry Whole w/Skin-Stwd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Garlic Powder"
      },
      {
        "name": "Red Wine"
      },
      {
        "name": "Chicken Stock-Prep f/Recipe"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Cut chicken into pieces. Heat oil in a large skillet over medium high heat. Season chicken parts with salt, pepper, and garlic powder and saute until lightly browned, about 5 to 7 minutes."
      },
      {
        "text": "Place wine in a shallow dish or bowl. Dip chicken pieces into wine, one at at time, and return to skillet. Add any remaining wine, stock and onions, stir together and reduce heat to medium."
      },
      {
        "text": "Cover skillet and cook for 30 minutes or until chicken is cooked through and no longer pink inside. In a small bowl, mix together cornstarch and water and add mixture to sauce to thicken; cook an additional 2 to 3 minutes and serve.\r\n\r\nServe with pasta or white steamed rice, if des"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Shrimp",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Fresh Sweet Green Bell Pepper-Med"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Shrimp Drained-4.5oz Can"
      },
      {
        "name": "Fresh Mature Mung Bean Sprouts"
      },
      {
        "name": "Chinese Waterchestnut Slices w/Liq-Cnd"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Water"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Soy Sauce-f/Soy"
      }
    ],
    "steps": [
      {
        "text": "Heat 1 tablespoon oil in a large skillet over medium heat. Saute chopped bell pepper and chopped onion until tender, then stir in chopped shrimp, bean sprouts, dained water chestnuts and 1 tablespoon soy sauce. Heat through, then remove skillet from heat and set aside."
      },
      {
        "text": "Heat 1 tablespoon oil in a second skillet. In a medium bowl, beat eggs until thick and lemon colored, about 5 minutes. Stir in vegetable mixture, then pour mixture into heated skillet, forming patties about 5 inches in diameter. Fry until browned, then turn and fry on other side until browned. Drain, place on an oven-safe platter and keep warm in oven until ready to serve."
      },
      {
        "text": "To Make Hot Soy Sauce: In a small bowl combine the cornstarch, water, bouillon and 2 tablespoons soy sauce and beat together. Serve wtih warm patties"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Eggplant Parmesan",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Eggplant Cubes Cooked-Drnd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Ricotta Cheese-Part Skim"
      },
      {
        "name": "Mozzarella Cheese LoMoist WhlMilk-Shred"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Fresh Basil-Chopped"
      },
      {
        "name": "Spaghetti/Marinara Sauce-rts"
      }
    ],
    "steps": [
      {
        "text": "Cut one whole eggplant into 3/4 inch slices. Sprinkle both sides of the eggplant slices with 1 1/2 tablespoons salt. Place slices in a colander, and place a dish underneath the colander to capture liquid that will sweat out of the eggplant. Allow to sit for 30 minutes."
      },
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl , mix the ricotta, mozzarella cheese and 1/4 cup Parmesan cheese. Mix in the beaten egg and basil."
      },
      {
        "text": "Rinse the eggplant in cold water until all salt is removed. In a large skillet, heat 4 tablespoons olive oil over medium heat. Place one layer of eggplant in the pan, brown each side. Repeat with remaining eggplant slices, using additional oil if necessary."
      },
      {
        "text": "In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. Arrange a single layer of eggplant slices on top of the sauce. Top the eggplant with 1/2 of the cheese mixture. Repeat layering process until all the eggplant and cheese mixture is used. Pour remaining sauce on top of layers, and sprinkle with remaining Parmesan cheese."
      },
      {
        "text": "Bake 30 to 45 minutes in the preheated oven, until sauce is bubbly.\r\n\r\nThis makes a delicious entree served with a salad and garlic bread.\r\n\r\nNOTE: As some of the 1 1/2 tabelspoons of salt is rinsed from the eggplant, only 1 tablespoon is used for the nutritional anal"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef Lumpia",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 10%Fat-Pan Browned"
      },
      {
        "name": "Ground Pork-Ckd"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Steamed Carrot Slices"
      }
    ],
    "steps": [
      {
        "text": "Make sure the lumpia wrappers are completely thawed. Lay several out on a clean dry surface and cover with a damp towel. The wrapers are very thin and the edges will dry out quickly."
      },
      {
        "text": "In a medium bowl, blend together the ground beef and pork, chopped onion, green pepper, and carrot. Place about 2 tablespoons of the meat mixture along the center of the wrapper. The filling should be no bigger around than your thumb or the wrapper will burn before the meat is cooked. Fold one edge of wrapper over to the other. Fold the outer edges in slightly, then continue to roll into a cylinder. Wet your finger, and moisten the edge to seal. Repeat with the remaining wrappers and filling, keeping finished lumpias covered to prevent drying. This is a good time to recruit a friend or loved one to make the job less repetitive!"
      },
      {
        "text": "Heat 1 quart oil in a 9 inch skillet at medium to medium high heat until oil is 365 to 375 degrees F (170 to 175 degrees C). Fry 3-4 lumpia at a time. It should only take 2-3 minutes for each side. The lumpia will be nicely browned when done. Drain on paper towels."
      },
      {
        "text": "You can cut each lumpia into thirds for parties, if you like. In the Phillippines, lumpia was eaten with banana ketchup, but I've never seen it sold in America.\r\n\r\nEditor's Note: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Forfar Bridies",
      "difficulty": 3,
      "duration": "35 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Lamb Ground 23% Fat-Raw"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Beef Bouillon-14.5oz rts Can"
      },
      {
        "name": "Worcestershire Sauce"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Single Pie Crust Prep f/Rec Unbkd-9\""
      },
      {
        "name": "Egg Whites Raw-Lrg"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "In a large heavy skillet over medium heat, cook 12 oz of raw ground lamb until evenly brown; drain excess fat. Remove from the heat, and stir in chopped onion, beef broth and Worcestershire sauce. Season with salt and pepper to taste."
      },
      {
        "text": "On a lightly floured surface, roll pastry (1 recipe of pastry for double pie crust) out to 1/8 inch thickness. Cut into 6 inch rounds. Place approximately 1/2 cup filling on one half of each. Fold the pastry over the filling, and crimp edges to seal. Brush lightly with beaten egg white, and cut three slits in the top to allow steam to escape. Place on baking sheet."
      },
      {
        "text": "Bake in preheated oven for 30 to 35 minutes, or until golden brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Gazpacho",
      "difficulty": 3,
      "duration": "3 Hr 25 Min",
      "numPlates": "4 to 6"
    },
    "ingredients": [
      {
        "name": "Fresh Red Tomatoes Year Round Avg Lrg-3\""
      },
      {
        "name": "Fresh Cucumber Whole 8.25\" Long"
      },
      {
        "name": "Fresh Sweet Green Bell Peppers-Lrg"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Ripe Black Olives Sliced-Cnd"
      },
      {
        "name": "White Wine Vinegar HCG-HF"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Water"
      },
      {
        "name": "Fresh White Onions Small-Whole"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Hard Boiled Eggs-Lrg"
      }
    ],
    "steps": [
      {
        "text": "Score a cross in the base of each tomato. Cover with boiling water for 1 minute, plunge into cold water, drain and peel away the skin. Chop the flesh so finely that it is almost a puree."
      },
      {
        "text": "Mix together the tomatoes, 1 of the chopped cucumbers, 1 of the chopped green peppers, crushed garlic, finely chopped olives, vinegar, oil and tomato paste, and season to taste with salt and pepper. Cover and refrigerate for 2 to 3 hours."
      },
      {
        "text": "Use 2 to 3 cups of chilled water to thin the soup to your taste. Serve chilled with the chopped onion, remainder of the chopped green pepper and cucumber, green onions, and chopped boiled eggs, served separately for diners to add to their own bowls. \r\n\r\nNOTE: Herbs and croutons are also excellent served with this"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Currywurst",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Kielbasa Beef & Pork Sausage-Slc"
      },
      {
        "name": "Chili Sauce DLM"
      },
      {
        "name": "Onion Salt MCC"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to Broil/Grill."
      },
      {
        "text": "Pour tomato sauce (3 - 15oz cans) into a large saucepan, then stir in the chili sauce, onion salt, sugar and pepper. Let simmer over medium heat, occasionally stirring; bring to a gently boil and reduce heat to low. Simmer another 5 minutes."
      },
      {
        "text": "Meanwhile, broil/grill kielbasa sausage for 3 to 4 minutes each side, or until cooked through. Slice into pieces 1/4 inch to 1/2 inch thick."
      },
      {
        "text": "Pour tomato sauce mixture over sausage, then sprinkle all with paprika and curry powder and serve"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Zwiebelkuchen Onion Pie",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "10 to 12"
    },
    "ingredients": [
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Cured Bacon-Pan Fried"
      },
      {
        "name": "Cultured Sour Cream"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Caraway Seeds"
      },
      {
        "name": "Single Pie Crust Prep f/Rec-Unbkd"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 425 degrees F (220 degrees C). Line a jelly-roll pan or large pizza pan with prepared dough (2 recipes for a 9 inch single crust pie), making sure dough extends up sides of pan."
      },
      {
        "text": "Saute sliced onion in a skillet until translucent and pour cooked onion into a large mixing bowl. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, chop and add to onion; mix well."
      },
      {
        "text": "Stir in sour cream. Beat eggs enough to break up yolks, then mix in to pie mixture. Add flour to thicken mixture (onions will create a lot of water), then add salt. Mix well and pour mixture into prepared pan. Sprinkle top with caraway seed."
      },
      {
        "text": "Bake in preheated oven for about 1 hour, or until onions start to turn golden brown on top"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lasagna",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "12"
    },
    "ingredients": [
      {
        "name": "Enrich Macaroni Noodles-Ckd"
      },
      {
        "name": "Beef Ground Hamburger 10%Fat-Pan Browned"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Feta Cheese-Crumbled"
      },
      {
        "name": "Diced Tomatoes-Cnd DLM"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "3.25% Whole Milk"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Salted Butter"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add macaroni noodles, and cook until tender, about 8 minutes. Drain, and set aside."
      },
      {
        "text": "Preheat the oven to 350 degrees F (175 degrees C). Cook 2 lb raw ground beef and chopped onion in a large skillet over medium-high heat until beef is evenly browned. Remove from heat, and drain grease. Stir in the tomatoes, feta cheese, Parmesan cheese, and cinnamon. Mix in pasta and transfer to a large baking dish."
      },
      {
        "text": "In a saucepan over medium heat, mix together the milk and cornstarch until no lumps remain. Add butter, and bring to a boil. Boil for 1 minute, then remove from heat, and pour the sauce over the mixture in the baking dish."
      },
      {
        "text": "Bake for 1 hour in the preheated oven, until the top is golden brown. Let stand for 10 minutes before serving"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Circassian",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "10"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Whole w/Skin-Stwd"
      },
      {
        "name": "Peeled Potato Ckd w/Salt Med-2.5\" to 3\""
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      },
      {
        "name": "Whole Carrots Cooked-Drnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "French Bread-Med Slc"
      },
      {
        "name": "Dried English Walnuts-Ground"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Dried Ground Red Chili Pepper"
      },
      {
        "name": "Table Salt"
      }
    ],
    "steps": [
      {
        "text": "In a large saucepan over medium heat, place chicken (cut into pieces), potato, onion and peeled carrot. Pour in water, and bring to a boil. Skim any foam from the surface, and season with 1 1/2 teaspoons salt. Reduce heat, and simmer for 1 hour, or until chicken and vegetables are tender. Strain and reserve broth. Discard vegetables. Allow chicken to cool, then remove skin and bones, and shred meat into very small pieces."
      },
      {
        "text": "Remove crusts from two 1-inch thick slices stale French bread. Soften the bread in some of the chicken broth, then squeeze out. In a large bowl, combine bread, ground walnuts, crushed garlic, red pepper, and 1 teaspoon salt. Using your hands, mix well like you're mixing meatballs. Place mixture in cheesecloth, and squeeze oil that the ground walnuts produce into a small bowl; set aside. Place walnut mixture into large bowl. Slowly blend in 1 cup of reserved chicken broth until consistency is like thick soup."
      },
      {
        "text": "Place shredded chicken in a porcelain or glass serving dish. Stir in 2 to 3 tablespoons of walnut mixture. Cover chicken with remaining walnut mixture so the chicken is not visible. Smooth surface with the back of a spoon. Pour reserved walnut oil over the top"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Ground Nut",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "10"
    },
    "ingredients": [
      {
        "name": "Creamy Peanut Butter"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Diced Tomatoes w/GrnPepper&Onion-Cnd DLM"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Mushroom Pieces Cooked w/Salt-Drnd"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      }
    ],
    "steps": [
      {
        "text": "Melt peanut butter in a large saucepan over medium heat. Stir in tomato paste, and blend with peanut butter until smooth. Mix in diced tomatoes with green chile peppers and chicken broth. Cook 15 minutes, stirring occasionally."
      },
      {
        "text": "Heat oil in a medium skillet over medium heat. Saute cubed chicken and onions until chicken is no longer pink and juices run clear."
      },
      {
        "text": "Mix chicken, onions, and mushrooms into the peanut butter mixture, and continue cooking, stirring occasionally, about 15 minutes. Season with cayenne pepper to taste"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Harira",
      "difficulty": 3,
      "duration": "2 Hr 30 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Lamb Shoulder Arm Choice 1/4\" Trim-Brsd"
      },
      {
        "name": "Ground Turmeric"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Ginger-Ground"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Diced Celery Cooked-Drnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Red Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Diced Tomatoes-Cnd DLM"
      },
      {
        "name": "Water"
      },
      {
        "name": "Mature Lentil Beans"
      },
      {
        "name": "Mature Garbanzo Beans-Cnd"
      },
      {
        "name": "Enrich Vermicelli Pasta-Dry APC-AB"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Fresh Lemon Juice-Yield Per Fruit"
      }
    ],
    "steps": [
      {
        "text": "Place the cubed lamb, turmeric, black pepper, cinnamon, ginger, cayenne, butter and chopped celery, onions and cilantro into a large soup pot over a low heat. Stir frequently for 5 minutes. Pour tomatoes (reserve juice) into the mixture and let simmer for 15 minutes."
      },
      {
        "text": "Pour reserved tomato juice, 7 cups water, and the green lentils into the pot. Bring mixture to a boil, then reduce the heat to simmer. Let soup simmer, covered, for 2 hours."
      },
      {
        "text": "About 10 minutes before serving turn the heat to medium-high, place chickpeas/garbanzo beans (drained) and noodles into the soup, let cook about 10 minutes (until noodles are al dente). Stir in lemon and beaten eggs, let eggs cook 1 minute.\r\n\r\nSeason with salt, pepper, mint leaves and cinnamon to t"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Spaghetti",
      "difficulty": 3,
      "duration": "4 Hrs",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Crushed Tomatoes-Cnd"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "SaucyBlend Italian Herb Seasoning MCC-FM"
      },
      {
        "name": "Dried Basil Leaves"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Red Wine"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      }
    ],
    "steps": [
      {
        "text": "In large saucepan over medium heat, saute the chopped onion and garlic in olive oil until soft. Stir in tomatoes, tomato paste, water, Italian seasoning, basil, sugar, wine and crushed red pepper. Reduce heat to low and simmer 3 hours, stirring occasionally. Serve.\r\n\r\nNOTE: The longer you cook it the better it ta"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Satay",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Green Onions Bulbs & Tops-Chpd"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Oil Roasted Spanish Peanuts-Salted"
      },
      {
        "name": "Lemon Juice-Btld/Cnd"
      },
      {
        "name": "Honey"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Coriander Seed"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Pork Tenderloin Chop-Brld"
      }
    ],
    "steps": [
      {
        "text": "In a food processor, process garlic, green onions,  chopped ginger, peanuts, lemon juice, honey, soy sauce, crushed coriander, and red pepper flakes. Puree until almost smooth. Pour in broth and melted butter, and mix again."
      },
      {
        "text": "Cut pork tenderloin into 1 inch cubes. Place pork cubes in a large resealable plastic bag, and pour mixture over meat. Marinate in the refrigerator for 6 hours, or overnight."
      },
      {
        "text": "Preheat grill for medium heat. Remove pork cubes from bag, and thread onto skewers. In a small saucepan, boil the marinade for 5 minutes. Reserve a small amount of the marinade for basting, and set the remainder aside to serve as a dipping sauce."
      },
      {
        "text": "Lightly oil preheated grill. Grill for 10 to 15 minutes, or until well browned, turning and brushing frequently with cooked marinade. Serve with dipping sauce"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Casserole",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Peeled Potato Diced-Ckd"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Dehyd Minced Onions"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Paprika"
      },
      {
        "name": "3.25% Whole Milk"
      },
      {
        "name": "Cheddar Cheese-Shredded"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Butter a 1.5 quart baking dish."
      },
      {
        "text": "In a medium bowl, combine the peeled and shredded potatoes, melted butter, beaten eggs, onion, salt and paprika. Mix well."
      },
      {
        "text": "Place potato mixture into the prepared baking dish and pour milk over top. Bake in the preheated oven for 40 minutes. Sprinkle top with sharp chedder cheese, return to oven and bake until cheese melts and is slightly browned"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Italian Gravy W/pork",
      "difficulty": 3,
      "duration": "5 Hrs",
      "numPlates": "12"
    },
    "ingredients": [
      {
        "name": "Extra Virgin Olive Oil NOI"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Pork Shoulder Blade Boston Roast-Rstd"
      },
      {
        "name": "Medium White Wine"
      },
      {
        "name": "Water"
      },
      {
        "name": "Oregano-Ground"
      },
      {
        "name": "Dried Parsley"
      },
      {
        "name": "Ground Thyme"
      },
      {
        "name": "Dried Rosemary"
      },
      {
        "name": "Garlic Powder"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Tomato Puree-Cnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "White Granulated Sugar"
      }
    ],
    "steps": [
      {
        "text": "Heat olive oil in a large stock pot over medium heat. Saute diced onions, and minced garlic until lightly browned. Place pork shoulder in pot, and pour in 1/2 cup white wine and 3 cups water. In a small bowl, combine oregano, parsley, thyme, rosemary, garlic powder, salt and pepper. Sprinkle 1/4 of spice mixture over pork. Cover, and cook for 30 minutes, turning occasionally. Add water periodically if needed."
      },
      {
        "text": "Pour in tomato puree. Fill cans with water, and pour in (about 6 cups). Stir in remaining spice mixture and the sugar. When liquid starts to bubble, reduce heat to low, cover, and cook for 4 to 5 hours. Stir occasionally, and adjust seasonings to taste"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Riboletta",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Whole Carrots Cooked-Drnd"
      },
      {
        "name": "Dried Crumbled Bay Leaves"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Chicken Broth-rts Can"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "Stewed Red Tomatoes-Cnd"
      },
      {
        "name": "Ground Thyme"
      },
      {
        "name": "Red Cabbage Shredded Cooked-Drnd"
      },
      {
        "name": "Peeled Potato Cooked-3\" to 4.25\""
      },
      {
        "name": "Mature Small White Beans-Ckd"
      },
      {
        "name": "Italian Bread-Med Slice"
      },
      {
        "name": "Parmesan Cheese-Grated"
      }
    ],
    "steps": [
      {
        "text": "In a large saucepan, heat the olive oil over medium heat. Cook the chopped onion, minced garlic, chopped celery and carrot until onion is soft."
      },
      {
        "text": "Stir in bay leaf, parsley, chicken stock, water, tomatoes, thyme, cabbage, diced potato, and cooked beans. Bring to a simmer and cook for about 40 minutes, or until beans are tender. Season with salt and pepper to taste."
      },
      {
        "text": "Preheart oven to 350 degrees F (175 degrees C). In a 4 quart casserole dish, place 1/3 of the mixture over the bottom. Layer 3 of the stale pieces of bread over the top. Place another 1/3 of the soup mixture over the bread followed by remaining 3 slices of bread. Top with remaining 1/3 soup."
      },
      {
        "text": "Sprinkle with Parmesan cheese and bake for 30-40 minutes, or until soup is bubbling and cheese is light golden"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Wedding",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 5% Fat-Pan Browned"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Dry Bread Crumbs"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Ground Basil"
      },
      {
        "name": "Onion Powder"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Fresh Escarole-Chopped"
      },
      {
        "name": "Enrich Orzo Pasta-Dry APC-AB"
      },
      {
        "name": "Fresh Carrots-Chpd"
      }
    ],
    "steps": [
      {
        "text": "In medium bowl, combine 1/2 lb raw meat, lightly beaten egg, bread crumbs, cheese, basil and onion powder; shape into 3/4 inch balls."
      },
      {
        "text": "In large saucepan, heat broth to boiling; stir in thinly sliced escarole, 1 cup dry orzo pasta, chopped carrots and meatballs. Return to boil, then reduce heat to medium. Cook at slow boil for 10 minutes, or until pasta is al dente. Stir frequently to prevent sticking"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Jambalaya",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Peanut Salad/Cooking Oil"
      },
      {
        "name": "Cajun Seasoning MCC"
      },
      {
        "name": "Smoked Pork Sausage Link-4\" x 1 1/8\""
      },
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Stwd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Crushed Tomatoes-Cnd"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Hot/Pepper Sauce-rts"
      },
      {
        "name": "Worcestershire Sauce"
      },
      {
        "name": "Long Grain White Rice-Dry DLM-SW"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      }
    ],
    "steps": [
      {
        "text": "Cut chicken into 1 inch pieces. Heat 1 tablespoon of the peanut oil in a large heavy Dutch oven over medium heat. Season the sliced andouille sausage and chicken pieces with Cajun seasoning. Saute sausage until browned. Remove with slotted spoon, and set aside. Add the other tablespoon of peanut oil, and saute chicken pieces until lightly browned on all sides. Remove with slotted spoon, and set aside."
      },
      {
        "text": "In same pot, saute diced onion, one diced green pepper, diced celery and minced garlic until tender. Stir in crushed tomatoes, and season wtih red pepper, black pepper, salt, hot pepper sauce, Worcestershire sauce and 1 tsp file powder. Stir in chicken and sausage. Cook for 10 minutes, stirring occasionally."
      },
      {
        "text": "Stir in the rice and chicken broth. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes, or until liquid is absorbed.\r\n\r\nNOTE: File powder is a seasoning made from the ground, dried leaves of the sassafras tree. It's an integral part of Creole cooking, and is used to thicken and flavor Gumbos and other Creole di"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Kaes-spaetzle",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Water"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Swiss Cheese-Shredded"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Fresh Parsley-Chpd"
      }
    ],
    "steps": [
      {
        "text": "In a large bowl, combine eggs, flour, salt, 1 tablespoon oil, and 1/2 cup water. Mix until smooth, then let rest for 10 minutes. Meanwhile, heat 1/4 cup oil in a skillet over medium heat. Saute onion slices until golden brown; set aside. Preheat oven to 300 degrees F (150 degrees C)."
      },
      {
        "text": "Bring a large pot of lightly salted water to a boil. Place 1/3 of the dough into a spaetzle maker or coarse sieve or collander wtih holes about 4 millimeters in diameter. Let dough drop into boiling water. Boil until spaetzle rises to the top, then transfer to a 9 inch casserole dish with a slotted spoon. Cover with 1/3 of the cheese. Repeat layers with remaining spaetzle and cheese. Spoon fried onions over top."
      },
      {
        "text": "Bake in preheated oven for 15 minutes, or until cheese is thoroughly melted. Before serving, sprinkle with 1 or 2 tablespoons vinegar, and sprinkle with chopped parsley"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Keema",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Lamb Ground 20% Fat-Broiled"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Tomato Paste-6oz Can"
      },
      {
        "name": "Beef Broth/Bouillon-14oz rts Can"
      }
    ],
    "steps": [
      {
        "text": "In a large heavy skillet over medium heat, cook ground lamb until evenly browned. While cooking, break apart with a wooden spoon until crumbled. Transfer cooked lamb to a bowl, and drain off all but 1 tablespoon fat. Saute finely chopped onion until soft and translucent, about 5 minutes. Stir in minced garlic and saute 1 minute. Stir in 2 tbsp garam masala and salt, and cook 1 minute. Return the browned lamb to the pan, and stir in tomato paste and beef broth. Reduce heat, and simmer for 10 to 15 minutes or until meat is fully cooked through, and liquid has evaporated"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Kugeli",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Cured Salt Pork Fat-Raw"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Peeled Potato Cooked-3\" to 4.25\""
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 450 degrees F (230 degrees C). Oil a 12x15 inch pan with olive oil."
      },
      {
        "text": "Place diced salt pork in a large, deep skillet over medium heat. Cook until evenly brown, stirring occasionally. Stir in 1 chopped onion, and continue cooking until onion is tender and lightly browned; set aside."
      },
      {
        "text": "Meanwhile, in a large bowl, combine potatoes and remaining 3 chopped onions. Fill the bowl of a food processor with the mixture, and 1 egg. Process until smooth, then transfer to a large bowl. Repeat until all has been processed.\r\nSeason with pepper to taste. Stir in the salt pork mixture. Blend in flour gradually to absorb some moisture, but err on the side of less flour."
      },
      {
        "text": "Bake in the preheated oven for 25 minutes. Reduce heat to 350 degrees F (175 degrees C), and continue baking for 1 hour, or until top is evenly browned."
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Kung Pao",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Medium White Wine"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Sesame Salad/Cooking Oil"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Water"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Chinese Waterchestnuts Whole w/Liq-Cnd"
      },
      {
        "name": "Dry Roasted Peanuts-Salted"
      }
    ],
    "steps": [
      {
        "text": "To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch dissolved in 1 tablespoon water and mix together. Place chicken pieces (cut into chunks) in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes."
      },
      {
        "text": "To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch dissolved in 1 tablespoon water, 1 oz hot chili paste, vinegar and sugar. Mix together and add chopped green onion, chopped garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic."
      },
      {
        "text": "Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, added sauteed chicken to it and let simmer together until sauce thickens.\r\n\r\nNOTE: The nutrition data for this recipe includes information for the full amount of the marinade ingredients. Depending on marinating time, ingredients, cooking method, etc., the actual amount of the marinade consumed will"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lamb Feta Peppers",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "4 to 6"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Fresh Dill Weed Sprigs"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Ground Allspice AST"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Enrich Long Grain White Rice-Ckd"
      },
      {
        "name": "Lamb Ground 20% Fat-Broiled"
      },
      {
        "name": "Feta Cheese-Crumbled"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "Fresh Lemon Juice"
      },
      {
        "name": "White Granulated Sugar"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 375 degrees F (190 degrees C)."
      },
      {
        "text": "Heat oil in a medium skillet over medium heat, add 1 chopped onion and cook for four minutes until soft. Stir in minced garlic and cook one minute."
      },
      {
        "text": "Slice tops off 6 whole peppers and remove seeds. Stand peppers upright in a 9x12 inch baking dish."
      },
      {
        "text": "In a large bowl, combine onion mixture, chopped dill, salt, allspice and pepper. Mix in rice and lamb, fold in feta cheese. Stuff peppers with mixture."
      },
      {
        "text": "Mix tomato sauce with water, lemon juice and sugar. Pour half over peppers, and half over bottom of dish. Cover with foil."
      },
      {
        "text": "Bake in preheated oven for 45 minutes. Uncover and continue baking 15 minutes, basting occasionally with sauce, until a meat thermometer inserted in center of filling reads 160 degrees F (70 degrees C)"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lamb W/green Beans",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "12"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Lamb Shoulder Arm Choice 1/4\" Trim-Brsd"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "Snap Green Beans Ckd-Drained"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Dried Spearmint"
      },
      {
        "name": "Dried Dill Weed"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large pot over medium heat. Saute chopped onion and celery until golden. Stir in lamb (cut into 2 inch pieces) and cook until evenly brown. Stir in tomato sauce and water. Reduce heat, and simmer for about 1 hour."
      },
      {
        "text": "Stir in green beans. Season with parsley, mint, dill, cinnamon, sugar and salt and pepper to taste. Continue cooking until beans are tender"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lasagna",
      "difficulty": 3,
      "duration": "2 Hr",
      "numPlates": "15"
    },
    "ingredients": [
      {
        "name": "Enrich Lasagna Noodles-Dry APC-AB"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Oregano-Ground"
      },
      {
        "name": "Ground Basil"
      },
      {
        "name": "Crushed Tomatoes-Cnd"
      },
      {
        "name": "Stewed Tomatoes w/Liquid-Cnd"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Ricotta Cheese-Part Skim"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "Spinach Cooked-Drnd"
      },
      {
        "name": "Zucchini Squash Slices w/Skin Ckd-Drnd"
      },
      {
        "name": "Mozzarella Cheese Whole Milk-Shredded"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Saute 1 chopped onion and 1 bay leaf in 4 tablespoons oil until onion is tender. Add chopped garlic, oregano, and 2 teaspoons basil; cook and stir for 2 more minutes. Add tomatoes. Cook for 1 hour. Stir in cinnamon and set pan aside."
      },
      {
        "text": "Bring a large pot of salted water to boil, add lasagna noodles and bring water to boil again. Cook until noodles are al dente. Drain well."
      },
      {
        "text": "Mix together ricotta, beaten eggs, 1/2 cup Parmesan cheese, and 2 teaspoons basil."
      },
      {
        "text": "Saute 1 sliced onion and  sliced muchrooms in 2 tablespoons oil until tender. Add chopped spinach and two sliced zucchini to the pot. Cover pot, and cook until spinach is wilted."
      },
      {
        "text": "Spread 1/2 cup of the tomato mixture into a 9x13 inch baking pan. Place 1 layer of noodles on top of the tomato sauce; spread all of the ricotta mixture onto the noodles; place another layer of noodles atop the ricotta mixture; pour 2 cups tomato sauce onto the noodles; arrange all of the sauteed vegetables on top of the sauce; arrange another layer of noodles; pour the remaining tomato sauce over the final layer of noodles and top with mozzarella cheese and 1 cup Parmesan cheese."
      },
      {
        "text": "Bake the lasagna for 45 minutes to 1 hour. Remove the lasagna from the oven and let it cool 10 minutes before serving"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pierogi",
      "difficulty": 3,
      "duration": "1 Hr 20 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Sauerkraut Canned-w/Liquid"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Enrich Rotini Noodles-Dry APC-AB"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Cream Of Mushroom Soup Cond-Cnd CAM-CS"
      }
    ],
    "steps": [
      {
        "text": "Place the sauerkraut and chopped onion in a large skillet over medium-low heat with enough water to cover. Simmer 1 hour, or until most of the water has cooked off."
      },
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add rotini and cook for 8 to 10 minutes or until al dente; drain."
      },
      {
        "text": "In a medium skillet over medium heat, saute the chopped mushrooms in 2 tablespoons of the butter for about 5 minutes."
      },
      {
        "text": "Stir the remaining butter, cooked pasta, and cream of mushroom soup into the sauerkraut mixture. Cook and stir 15 minutes, or until heated through"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lubia Polo",
      "difficulty": 3,
      "duration": "1 Hr  10 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 15%Fat-Pan Browned"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Jalapeno Peppers"
      },
      {
        "name": "Curry Powder"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Mature Green Gram Beans-Ckd"
      },
      {
        "name": "Basmati Rice-Dry FFS-EG"
      },
      {
        "name": "Canola Oil"
      }
    ],
    "steps": [
      {
        "text": "In a large non-stick pot over high heat, brown 1 lb raw ground beef until no pink shows. Stir in chopped onion and finely chopped jalapeno, and cook until tender. Season with curry powder. Stir in chicken broth and tomato sauce. Bring to a boil, and stir in green beans. Cook for 15 minutes, or until beans are tender."
      },
      {
        "text": "Stir in rice, and cover pot. Reduce heat to medium, and cook for 10 to 15 minutes, or until much of the liquid is absorbed. (Be careful not to overcook rice at this point or the dish will be mushy; the rice should be firm.) Remove entire contents to another container, and return pot to the stove."
      },
      {
        "text": "Heat oil in the bottom of pot over medium heat (make sure it is a non-stick pot). Dump rice mixture back into pot. Wrap a clean dish towel around the inside of the pot's lid (the ends of the dish towel will be folded over the edges on the top of the lid), and put the lid on the pot. Cook for 35 minutes, without uncovering or stirring. Remove lid and place a tray on top of the pot, then carefully flip it over. The rice will hold the shape of the pot with a nice crust on top call 'tah digh.'\r\n\r\nCopyright @ 2005\r\nwww.allrecipes.com\r\n\r\nRecipe submitted by Tri"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Ma Po Tofu",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Ground Pork-Ckd"
      },
      {
        "name": "Sherry Cooking Wine BGF-RE"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Black Beans Fermented-Szechwan INTL"
      },
      {
        "name": "Hot Chili Sauce f/Mature Red Peppers"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Tamari Soy Sauce"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Firm Tofu w/Calcium Sulfate-Block"
      },
      {
        "name": "Green Peas Fzn-10oz Pkg"
      },
      {
        "name": "Chicken Broth-rts Can"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Municipal Tap Water"
      }
    ],
    "steps": [
      {
        "text": "In a small bowl, combine ground pork, sherry, and 1 teaspoon cornstarch; set aside."
      },
      {
        "text": "In a separate bowl, combine black beans (rinsed and mashed), 1/2 tbsp chile paste with garlic (chili sauce used in recipe), cayenne pepper, soy sauce, crushed garlic, and minced ginger; set aside."
      },
      {
        "text": "Heat a large skillet over medium heat. Cook pork until evenly browned. Stir in black bean mixture, tofu (drained and cut into cubes), and peas. Pour in chicken broth, and bring to a boil. Stir in cornstarch dissolved in 1 tablespoon water, and cook until thickened.\r\n\r\nNOTE: This dish is best served with steamed white rice. You can control the spice by varying the cay"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Rendang",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Fresh Shallots-Chpd"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Dried Arbol Chile Pepper FSP"
      },
      {
        "name": "Fresh Ginger Root Slices"
      },
      {
        "name": "Fresh Lemon Grass"
      },
      {
        "name": "Coriander Seed"
      },
      {
        "name": "Fennel Seed"
      },
      {
        "name": "Cumin Seed"
      },
      {
        "name": "Nutmeg-Ground"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Beef Stew Meat-Ckd SVY"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Fresh Coconut-Shredded"
      },
      {
        "name": "Coconut Milk-Canned"
      },
      {
        "name": "Water"
      },
      {
        "name": "Table Salt"
      }
    ],
    "steps": [
      {
        "text": "Heat the coconut in a dry wok, stirring continuously until golden brown. Set aside to cool."
      },
      {
        "text": "Using a blender or a food processor, blend the shallots, garlic, 15 dried red chilies, ginger, and 5 stalks or about 4 tablespoons minced lemon grass to a thick paste."
      },
      {
        "text": "Grind the coriander, fennel, cumin and nutmeg."
      },
      {
        "text": "Using the wok, fry the shallot paste in a little oil for a few minutes. Add the ground coriander, fennel, cumin and nutmeg; cook for 3 to 4 minutes, stirring continuously. Add beef (cut into 1 inch cubes); cook over a medium heat for a further 3 to 4 minutes, or until meat is browned."
      },
      {
        "text": "Stir in sugar, coconut, 5 cloves, 1 cinnamon stick, coconut milk, and water. Bring to a boil, lower heat, and simmer until most of the liquid has gone and the meat is tender (about 1 hour). Season with salt to taste.\r\n\r\nNOTE: Serve over"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Malooba",
      "difficulty": 3,
      "duration": "2 Hr",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Whole w/Skin-Stwd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Ground Allspice-Dried"
      },
      {
        "name": "Ground Cardamom"
      },
      {
        "name": "Enrich Long Grain White Rice-Ckd"
      },
      {
        "name": "Ground Allspice-Dried"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Baked Potato w/Skin Unsalted-Med"
      },
      {
        "name": "Fresh Cauliflower Large Head-6\" to 7\""
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      }
    ],
    "steps": [
      {
        "text": "Place chicken (cut into pieces) in a large pot with 6 cups water, quartered onion, 2 tablespoons allspice, ground cardamon, 3 whole cardamon seeds, 4 whole cloves and 3 bay leaves. Bring to a boil, and cook until chicken is tender, about 40 minutes. Remove chicken, strain and reserve broth."
      },
      {
        "text": "Rinse and drain the rice. Then soak the rice in water while waiting for the chicken to cook. When the chicken is almost done, drain the water off, and stir in 1 1/2 tablespoons of allspice."
      },
      {
        "text": "Heat the oil in a skillet over medium-high heat. Fry the sliced potato rounds and cauliflower (separated into florets) in the hot oil until browned. They do not need to fully cook."
      },
      {
        "text": "In a separate pot, layer fried potatoes on the bottom. This is done so that the rice will not stick to the bottom of the pan. Add the cauliflower and tomatoes, and sprinkle a handful of rice over the vegetables. Remove the bones from the chicken and place the chicken in the pot. Cover with the rest of the rice. Pour in the reserved broth until it reaches a level about 1/2 inch above the level of the rice. Cover the pot, and cook over medium-low heat for 1 hour, until rice is tender."
      },
      {
        "text": "When the liquid has absorbed, have a large round tray ready. Uncover the pot, and place the tray over the top. Invert so that the pan is upside down on top of the tray. Let stand for 5 minutes like this, then slowly remove the pot to let the food fall onto the tray.\r\n\r\nNOTE: You may substitute 1 large eggplant for cauliflower or use both. Slice eggplant in rounds, cut larger pieces in half. If using eggplant with the cauliflower, add it to the pot along with the caulifl"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Manicotti",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Ricotta Cheese-Part Skim"
      },
      {
        "name": "Mozzarella Cheese LoMoist PartSkim-Shred"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Dried Parsley"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Spaghetti/Marinara Sauce-rts"
      },
      {
        "name": "Enrich Manicotti Pasta-Dry APC-AB"
      }
    ],
    "steps": [
      {
        "text": "Cook manicotti in boiling water until done. Drain, and rinse with cold water."
      },
      {
        "text": "Preheat oven to 350 degree F (175 degrees C)."
      },
      {
        "text": "In a large bowl, combine ricotta, mozzarella, and 1/2 cup Parmesan, eggs, parsley, and salt and pepper. Mix well."
      },
      {
        "text": "Pour 1/2 cup sauce into a 11x17 inch baking dish. Fill each manicotti shell with 3 tablespoons cheese mixture, and arrange over sauce. Pour remaining sauce over top, and sprinkle with remaining Parmesan cheese."
      },
      {
        "text": "Bake 45 minutes, or until bubbly"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef W/blackeyed Beans",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Water"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Sml-2 2/5\""
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Eagle Chili Powder CON-GB"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Ground Turmeric"
      },
      {
        "name": "Beef Rib Steak Choice 1/8\"Trim-Rstd"
      },
      {
        "name": "Plain Mature Black Eyed Peas-Cnd"
      },
      {
        "name": "Fresh Lemon Juice"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Fresh Hot Green Chile Peppers-Chpd"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large deep skillet over medium-high heat. Add finely chopped onion, and saute until light golden, then throw in the finely chopped garlic, and cook for 1 minute. Put in 1/4 cup of the water and chopped tomato, then season with salt, red chilli powder, cumin, and turmeric. Simmer for 1 minute."
      },
      {
        "text": "Add minced beef and cook for at least 10 minutes, adding another 1/4 cup of the water when it gets dry. When the beef mixture is dry, pour in the drained, black-eyed peas. Cook for 3 minutes. Stir in the remaining 1/4 cup water, and reduce the heat to low. Cover and simmer until all the water has cooked down, and you can see the oil."
      },
      {
        "text": "Remove from the heat and mix in 1/8 tsp garam masala. Transfer to a serving dish and sprinkle the lemon juice, cilantro, and green chilies over the top"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Casserole",
      "difficulty": 3,
      "duration": "1 Hr 5 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Paprika"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Fresh Lemon Juice-Yield Per Fruit"
      },
      {
        "name": "Red Wine Vinegar"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Fresh Red Potatoes w/Skin-Med2.25\"-3.25\""
      },
      {
        "name": "Sweet Red Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Fresh Sweet Yellow Peppers Lrg-3.75\"Long"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Combine garlic, 1/2 teaspoon salt, paprika, cumin, and cayenne in a food processor bowl. Process until mixture forms a paste. Add herbs, and pulse a few times to blend. Add lemon juice, vinegar, and 2 to 3 tablespoons olive oil; blend. Season to taste with salt."
      },
      {
        "text": "In a large bowl, combine 1/2 inch sliced potatoes, one each red, yellow and green peppers (red peppers cut into 1 inch pieces, yellow peppers cut into 1 1/2 inch squares,  and green peppers cut into 1 1/2 inch pieces), and celery cut into 2 inch pieces. Season with salt, and toss with herb sauce. Transfer to a large shallow baking dish. Scatter wedged tomatoes among the potato mixture. Drizzle 1 to 2 tablespoons oil over top, and cover with foil."
      },
      {
        "text": "Bake for 35 minutes. Remove foil. Continue baking until vegetables are tender, 20 to 30 minutes. Serve warm"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Mou Shu Pork",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Pork Tenderloin Lean-Rstd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Bok Choy Cabbage Cooked-Drnd"
      },
      {
        "name": "Sweet Red Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Mushrooms Cooked Drained-Whole"
      },
      {
        "name": "Steamed Mature Soybean Sprouts"
      },
      {
        "name": "Japanese Sake/Saki Wine"
      },
      {
        "name": "Hoisin Sauce-rts"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Flour Tortilla rtb-7\" to 8\""
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 325 degrees F (165 degrees C). Wrap tortillas in foil."
      },
      {
        "text": "Heat a large skillet over high heat until very hot. Add pork cut into 1/4 inch thick strips, thinly sliced onion, and minced ginger and garlic; cook and stir until pork is brown and onion is tender, about 5 minutes. Mix in thinly sliced bok choy, one sliced red bell pepper, julienned mushrooms; cook and stir until bell pepper is tender-crisp, about 5 minutes. Remove pan from heat."
      },
      {
        "text": "Place tortillas in oven for 8 minutes, or until warm."
      },
      {
        "text": "Meanwhile, return pan to high heat source, and mix in bean sprouts, sake, and hoisin and soy sauces; cook and stir until bean sprouts are tender-crisp, about 5 minutes."
      },
      {
        "text": "Remove tortillas from oven. Divide pork mixture among tortillas, and roll up. Serve immediately.\r\n\r\nNOTE: Hoisin sauce, also called Peking sauce, is a thick, reddish-brown sauce that is sweet and spicy, and widely used in Chinese coo"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Musaka",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Beef Ground Hamburger 15%Fat-Pan Browned"
      },
      {
        "name": "Paprika"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Peeled Potato Cooked-2.25\" to 3.25\""
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "LowFat Plain Yogurt w/12gProtein Per Cup"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 325 degrees F. (165 degrees C)."
      },
      {
        "text": "Heat oil in a skillet over medium heat. Cook 1 lb raw ground beef until evenly brown. Season with paprika, cumin, salt, and pepper. Stir in potatotes cut into 1/2 inch cubes, and cook for 2 to 3 minutes. Stir in tomato sauce, and 1 tbsp summer savory (chubritsa). Add enough water to just barely cover. Reduce heat, and simmer 15 minutes."
      },
      {
        "text": "Pour meat mixture into 9x13 inch baking dish, and spread evenly. In a small bowl, mix together the lightly beaten egg and yogurt; pour, and spread evenly over meat mixture."
      },
      {
        "text": "Bake in preheated oven for 30 to 40 minutes, or until top is golden brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Hot And Sour",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "8 TO 10"
    },
    "ingredients": [
      {
        "name": "Chicken Broth-rts Can"
      },
      {
        "name": "Fresh Ginger Root Slices"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Fresh Sweet Red Bell Peppers-Med"
      },
      {
        "name": "Fresh Mushroom Pieces/Slices"
      },
      {
        "name": "Fresh Bamboo Shoot Slices"
      },
      {
        "name": "White Rice Vinegar CBT"
      },
      {
        "name": "Chili Pepper-pwd"
      },
      {
        "name": "Sesame Salad/Cooking Oil"
      }
    ],
    "steps": [
      {
        "text": "In a large cooking pot, add chicken broth, ginger root, and 1 tsp black peppercorns, and bring to a boil. Reduce heat to low and simmer uncovered for 20 minutes."
      },
      {
        "text": "Strain broth, discard ginger root and peppercorns. Returned strained broth to pot. Add chopped green onions, diced red pepper, sliced mushrooms, bamboo shoots, rice wine vinegar, chili powder and sesame oil. Simmer for 10 minutes or until vegetables are just tender. Serve in soup bowls over cooked white or brown rice"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pad Thai",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Rice Noodles-Dry"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Fish Sauce-rts"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Fresh Lentil Bean Sprouts"
      },
      {
        "name": "Dry Roasted Peanuts-Unsalted"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Fresh Lemon w/Peel-Seedless"
      }
    ],
    "steps": [
      {
        "text": "Soak rice noodles in cold water 30 to 50 minutes, or until soft. Drain, and set aside."
      },
      {
        "text": "Heat butter in a wok or large heavy skillet. Saute chicken cut into bite-sized pieces, until browned. Remove, and set aside. Heat oil in wok over medium-high heat. Crack eggs into hot oil, and cook until firm. Stir in chicken, and cook for 5 minutes. Add softened noodles, and vinegar, fish sauce, sugar and red pepper. Adjust seasonings to taste. Mix while cooking, until noodles are tender. Add bean sprouts, and mix for 3 minutes.\r\n\r\nGarnish with crushed peanuts, chopped green onions and wedge of l"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pancit",
      "difficulty": 3,
      "duration": "50 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Rice Noodles-Dry"
      },
      {
        "name": "Chicken Broil/Fry Leg w/oSkin-Rstd"
      },
      {
        "name": "Pork Tenderloin-Rstd"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Cabbage Head Lrg 7\" Ckd-Drnd"
      },
      {
        "name": "Whole Carrots Cooked-Drnd"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Mixed Species Shrimp Large-Stmd"
      }
    ],
    "steps": [
      {
        "text": "Place the rice noodles in a large bowl, and cover with warm water. When soft, cut into 4 inch lengths, drain, and set aside."
      },
      {
        "text": "In a skillet over medium heat, brown the chicken and pork (cut into bite-size pieces), until no pink shows. Season with soy sauce and pepper. Remove from skillet and set aside. Saute the shredded cabbage and shredded carrots until tender. Stir in the noodles, green onions and shrimp. Cook for 4 to 5 minutes, stir in the chicken and pork, and cook for 5 more minutes"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pasta Carbonara",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Cured Pork Bacon Cooked-Med Slc"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Heavy Whipping Cream"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Enrich Spaghetti Noodles-Ckd"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Cut bacon into small pieces and cook until crisp. Drain on paper towels."
      },
      {
        "text": "In medium bowl beat together eggs and cream, both at room temperatuare, just until blended. Stir in cheese and set aside."
      },
      {
        "text": "Cook fettuccini pasta according to package directions. Drain and return to pan. Toss with butter until it is melted. Add bacon and cheese mixture and toss gently until mixed.\r\n\r\nNOTE: Lots of crispy bacon is tossed with hot, buttered noodles, whipped eggs and cream, and a generous measure of Parmesan cheese. Stir until the heat of the pasta cooks the eggs, then serve with parsley and ground pe"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pasta Milan",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "2"
    },
    "ingredients": [
      {
        "name": "Enrich Macaroni Noodles-Ckd"
      },
      {
        "name": "Green Peas Fzn-10oz Pkg"
      },
      {
        "name": "Asparagus Cooked-Drnd"
      },
      {
        "name": "Gorgonzola Cheese SCH-SF"
      },
      {
        "name": "Heavy Whipping Cream"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add penne pasta, peas and asparagus to boiling water. Cook for 5 minutes or until pasta is al dente. Drain."
      },
      {
        "text": "Meanwhile, crumble cheese with the cream and season with salt and pepper to taste."
      },
      {
        "text": "In large bowl, toss pasta and vegetables with cheese mixture, stirring until the cheese has melted and the pasta is well coated with the sauce. Serve immediately"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pasta Pomodoro",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Enrich Spaghetti Noodles-Ckd"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Red Tomatoes YearRoundAvg-Chpd/Slc"
      },
      {
        "name": "Balsamic Vinegar HCG-HF"
      },
      {
        "name": "Low Sodium Chicken Broth-Cnd"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Fresh Basil-Chopped"
      },
      {
        "name": "Parmesan Cheese-Grated"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add angel hair pasta and cook for 8 minutes or until al dente; drain."
      },
      {
        "text": "Pour olive oil in a large deep skillet over high heat. Saute chopped onions and minced garlic until lightly browned. Reduce heat to medium-high and add diced tomatoes, vinegar and chicken broth; simmer for about 8 minutes."
      },
      {
        "text": "Stir in red pepper, black pepper, basil and cooked pasta, tossing thoroughly with sauce. Simmer for about 5 more minutes and serve topped with grated cheese"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Pastachutta",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Enrich Spaghetti Noodles-Ckd"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain, but do not rinse."
      },
      {
        "text": "Meanwhile, melt butter in a large skillet over medium-high heat. Saute thinly sliced garlic, mushrooms and chopped onion until tender. Toss with cooked spaghetti. Season with salt and pepper to taste"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Peking",
      "difficulty": 3,
      "duration": "1 Hr 35 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Duck Whole w/Skin Domesticated-Rstd"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Ground Ginger"
      },
      {
        "name": "Ground Nutmeg"
      },
      {
        "name": "White Pepper"
      },
      {
        "name": "Ground Cloves"
      },
      {
        "name": "Tamari Soy Sauce"
      },
      {
        "name": "Honey"
      },
      {
        "name": "All Types Fresh Orange Medium-2 5/8\""
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Plum Jam JMS"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Mango Chutney w/Oil-Whole Content INTL"
      }
    ],
    "steps": [
      {
        "text": "Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck into the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight."
      },
      {
        "text": "Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion."
      },
      {
        "text": "Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork."
      },
      {
        "text": "Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char."
      },
      {
        "text": "Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them in a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Meat & Potatoes",
      "difficulty": 3,
      "duration": "35 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Peeled Potato Cooked-3\" to 4.25\""
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Onion Powder"
      },
      {
        "name": "Garlic Powder"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Kielbasa Beef & Pork Sausage-Slc"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large skillet over medium-high heat. Cook chopped onions and potatoes (cut into 1 inch cubes) for 15 minutes, stirring occasionally. Reduce flame to medium and stir in two bell peppers (cut into 1 inch pieces), onion powder, garlic powder, salt and pepper. Cover, and cook 5 minutes. Stir in kielbasa, cover and cook for 15 minutes, or until onions are caramelized"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Marinated",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Pork Tenderloin-Rstd"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Red Wine Vinegar HCG-HF"
      },
      {
        "name": "Sweet Port Desset Wine"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      }
    ],
    "steps": [
      {
        "text": "Heat 2 tablespoons olive oil in a large heavy skillet over high heat. Saute pork (cut into bite-size pieces) until evenly browned, and fully cooked. Transfer to a bowl, and sprinkle with cilantro and garlic; keep warm."
      },
      {
        "text": "In a small bowl, combine 3 tablespoons olive oil, vinegar and port. Season with salt, black pepper, and cayenne. Whisk until consistency is creamy. Stir into cooked pork, and serve immediately.\r\n\r\nServe with French b"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Fava Beans",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Paprika"
      },
      {
        "name": "Mature Fava/Broad Beans Cnd-w/Liquid"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large saucepan over medium heat. Saute chopped onions and minced garlic until golden brown. Stir in red pepper flakes, tomato sauce, hot water, parsley, salt, pepper and paprika. Bring to a boil, reduce heat and simmer for 30 minutes."
      },
      {
        "text": "Gently stir in fava beans. Remove from heat and let stand for several minutes to allow flavors to meld"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Poulet Parisienne",
      "difficulty": 3,
      "duration": "1 Hr 15 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/Skin-Rstd"
      },
      {
        "name": "Cream Of Mushroom Soup Cond-Cnd CAM-CS"
      },
      {
        "name": "Mushrooms Canned Drained-Slc"
      },
      {
        "name": "Cultured Sour Cream"
      },
      {
        "name": "Sherry Cooking Wine BGF-RE"
      },
      {
        "name": "Paprika"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Place chicken breasts skin-side up in an 11x17 inch baking dish. In a medium bowl combine soup, muchrooms with liquid, sour cream and sherry. Mix well and pour mixture over chicken. Sprinkle with paprika."
      },
      {
        "text": "Bake at 350 degrees F (175 degrees C) for about 1 1/4 hours, or until chicken is cooked through and tender, and juices run clear"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Plantains",
      "difficulty": 3,
      "duration": "5 Min",
      "numPlates": "2"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Fresh Plantain-Med"
      },
      {
        "name": "Table Salt"
      }
    ],
    "steps": [
      {
        "text": "Heat 5 tablespoons oil in a large skillet. Place the plantains (peeled and broken into chunks) in the oil and fry on both sides; approximately 3 1/2 minutes per side."
      },
      {
        "text": "Remove the plantains from the pan and flatten them by placing a plate over the fried plantains and pressing down."
      },
      {
        "text": "Dip the plantains in 3 cups cold water, then return them to the hot oil and fry 1 minute on each side. Salt to taste and serve immediately"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken Quesadillas",
      "difficulty": 3,
      "duration": "7 Min",
      "numPlates": "10"
    },
    "ingredients": [
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Salsa-rts"
      },
      {
        "name": "Flour Tortilla rtb-10\""
      },
      {
        "name": "Cheddar & Monterey Jack Cheese-Shred KFT"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Spray a cookie sheet with non-stick cooking spray."
      },
      {
        "text": "In a large skillet, fry the chicken (cut into strips) in oil until they are no longer pink. Add the onion (sliced into strips) and fry, stirring constantly, until they are translucent. Mix in the salsa (you may want to add more to taste)."
      },
      {
        "text": "Place the tortillas between two damp paper towels and microwave on high for 1 minute."
      },
      {
        "text": "Fill half of 1 tortilla with the chicken mixture and cheese, then fold the tortilla over the full half. Repeat with remaining tortillas and filling. Arrange the quesadillas on the cookie sheet."
      },
      {
        "text": "Bake the quesadillas in the preheated 350 degree F (175 degree C) oven until the cheese has melted. Cut the quesadillas into fours"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Quiche Lorraine",
      "difficulty": 3,
      "duration": "55 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Single Pie Crust Prep f/Rec-Unbkd"
      },
      {
        "name": "Cured Bacon-Pan Fried"
      },
      {
        "name": "Swiss Cheese-Shredded"
      },
      {
        "name": "Fresh White Onions-Chpd"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Light Cream"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 425 degrees F (220 degrees C)."
      },
      {
        "text": "Place bacon in a large skillet, and fry over medium-high heat until crisp. Drain on paper towels, then chop coarsely. Sprinkle bacon, cheese, and onion into pastry shell."
      },
      {
        "text": "In a medium bowl, whisk together beaten eggs, cream, salt, sugar and cayenne pepper. Pour mixture into pastry shell."
      },
      {
        "text": "Bake 15 minutes in the preheated oven. Reduce heat to 300 degrees F (150 degrees C), and bake an additional 30 minutes, or until a knife inserted 1 inch from edge comes out clean. Allow quiche to sit 10 minutes before cutting into wedges"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Ratatouille",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Dried Parsley"
      },
      {
        "name": "Eggplant Cubes Cooked-Drnd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Zucchini Squash Slices w/Skin Ckd-Drnd"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Fresh Red Tomatoes Year Round Avg Lrg-3\""
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Coat bottom and sides of a 1 1/2 quart casserole dish with 1 tablespoon olive oil."
      },
      {
        "text": "Heat remaining 1 tablespoon olive oil in a medium skillet over medium heat. Saute minced garlic until lightly browned. Mix in parsley and one eggplant, cut into 1/2 inch cubes. Saute until eggplant is soft, about 10 minutes. Season with salt to taste."
      },
      {
        "text": "Spread eggplant mixture evenly across bottom of prepared casserole dish. Sprinkle with a few tablespoons of Parmesan cheese. Spread two sliced zucchini in an even layer over top. Lightly salt and sprinkle with a little more cheese. Continue layering in this fashion, with onions (sliced into rings), sliced mushrooms, one sliced bell pepper, and chopped tomatoes, covering each layer with a sprinkling of salt and cheese."
      },
      {
        "text": "Bake in preheated oven for 45 minutes"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Tamales",
      "difficulty": 3,
      "duration": "3 Hr",
      "numPlates": "16"
    },
    "ingredients": [
      {
        "name": "Pork Whole Loin-Rstd"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Sun Dried Hot Chili Peppers"
      },
      {
        "name": "Water"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Enrich Masa Harina Corn Flour-BkdValue"
      },
      {
        "name": "Beef Broth/Bouillon-14oz rts Can"
      },
      {
        "name": "Double Acting SodAlumSulft Baking Powder"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Lard"
      },
      {
        "name": "Cultured Sour Cream"
      }
    ],
    "steps": [
      {
        "text": "Place pork into a Dutch oven with the halved onion and garlic, and add water to cover. Bring to a boil, then reduce heat to low and simmer until the meat is cooked through, about 2 hours."
      },
      {
        "text": "Use rubber gloves to remove stems and seeds from the chile pods. Place chiles in a sauce pan with 2 cups water. Simmer, uncovered, for 20 minutes, then remove from heat to cool. Transfer the chiles and water to a blender and blend until smooth. Strain the mixture, stir in salt, and set aside. Shred the cooked meat and mix in one cup of the chile sauce."
      },
      {
        "text": "Soak the corn husks (18 oz pkg)  in a bowl of warm water. \r\n\r\nTamake Doug"
      },
      {
        "text": "In a large bowl, beat the lard with a tablespoon of the broth until fluffy. Combine the masa harina, baking powder and salt; stir into the lard mixture, adding more broth as necessary to form a spongy dough."
      },
      {
        "text": "Spread the dough out over the corn husks to 1/4 to 1/2 inch thickness. Place one tablespoon of the meat filling into the center. Fold the sides of the husks in toward the center and place in a steamer. Steam for 1 hour."
      },
      {
        "text": "Remove tamales from husks and drizzle remaining chile sauce over. Top with sour cream. For a creamy sauce, mix sour cream into the chile sauce"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Reshmi Kebab",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Dried Almonds-Whole"
      },
      {
        "name": "Fresh Jalapeno Peppers"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Ginger Root"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Fresh Lemon Juice-Yield Per Fruit"
      },
      {
        "name": "Heavy Whipping Cream"
      },
      {
        "name": "Chicken Broil/Fry Breast w/oSkin-Rstd"
      },
      {
        "name": "Salted Butter"
      }
    ],
    "steps": [
      {
        "text": "Place almonds in a small bowl and cover with water. Allow to soak for 15 to 20 minutes; drain. Place almonds, seeded and chopped peppers, garlic, ginger, and chopped cilantro into the bowl of a food processor; blend until smooth. Season with salt to taste, and blend in lemon juice. Blend in cream."
      },
      {
        "text": "Transfer mixture to a large, non metallic bowl. Place chicken in bowl, and turn to coat. Cover, and marinate in refrigerator for 24 hours."
      },
      {
        "text": "Preheat grill for high heat, and lightly oil grate. Remove meat from marinade, and thread onto skewers."
      },
      {
        "text": "Brush meat with butter, and arrange skewers on hot grate. Slowly cook the chicken until cooked through"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Souvlaki",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Lamb Composite Choice 1/8\" Trim-Cooked"
      },
      {
        "name": "Sauce, souvlaki marinade, Greek"
      },
      {
        "name": "LowFat Plain Yogurt w/12gProtein Per Cup"
      },
      {
        "name": "Fresh Cucumber Whole 8.25\" Long"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Olive Salad/Cooking Oil"
      },
      {
        "name": "Dried Dill Weed"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Enrich White Pita Bread-Lrg 6 1/2\""
      },
      {
        "name": "Fresh Red Onions Medium Whole-2.5\""
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      }
    ],
    "steps": [
      {
        "text": "Place lamb (cut into 1 inch square cubes) in a large bowl. Add 1/2 recipe of Souvlaki Marinade. Stir until lamb is well coated. Cover, and refrigerate 3 hours, or overnight."
      },
      {
        "text": "Prepare grill, and lightly oil grate. In a small bowl, combine yogurt, shredded cucumber, minced garlic and 2 tablespoons olive oil. Season with dill weed, salt and pepper to taste; set aside."
      },
      {
        "text": "Thread meat onto skewers. Grill 10 minutes, turning once. Lightly sprinkle pita bread with remaining 2 tablespoons olive oil, and place on grill until warm, about 1 minute. Serve meat on pita bread along with thinly sliced red onion, thinly sliced tomato and yogurt sauce.\r\n\r\nNOTE: Nutritional anaysis for this recipe includes information for half the amount of marinade ingredients. Depending on marinating time, ingredients, cooking method, etc. the actual amount of the marinade consumed will"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Shrimp Chow Mein",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Diced Celery Cooked-Drnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Sweet Red Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Mixed Species Shrimp Large-Stmd"
      },
      {
        "name": "Mixed Vegetables w/Liquid-Cnd"
      },
      {
        "name": "Cmrcl Cream Of Mushroom Soup Cond-Cnd"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Chow Mein Noodles-Ckd FSP"
      }
    ],
    "steps": [
      {
        "text": "In a large saucepan, combine chopped celery, diced onions, one sliced red pepper and shrimp (peeled and deveined). Cook over medium heat until shrimp are pink."
      },
      {
        "text": "Mix in drained canned vegetables and mushroom soup, soy sauce, and chopped green pepper."
      },
      {
        "text": "Heat thoroughly. Serve over 4 cups cooked chow mein noodles (cooked from 2 cups dry)"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Fettucine Alfredo",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "5"
    },
    "ingredients": [
      {
        "name": "Enrich Spaghetti Noodles-Ckd"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Mixed Species Shrimp Large-Stmd"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Half & Half Cream"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Table Salt"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add fettuccini pasta and cook for 8 to 10 minutes or until al dente; drain."
      },
      {
        "text": "In a large skillet, saute shrimp (peeled and deveined) and minced garlic in the butter for about one minute. Pour in half and half; stir. Sprinkle Parmesan cheese in one tablespoon at a time, stirring constantly. After all Parmesan is added, mix in parsley and salt. Stir frequently making sure it does not boil. Sauce will take a while to thicken."
      },
      {
        "text": "When sauce has thickened, combine with cooked pasta noodles; serve hot"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Tempura",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Japanese Rice Wine"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Raw Mixed Species Shrimp-Lrg"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Water"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Egg Yolks Raw-Lrg"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Household Shortening"
      },
      {
        "name": "Double Acting SodAlumSulft Baking Powder"
      }
    ],
    "steps": [
      {
        "text": "In a medium bowl, mix rice wine and 1/4 teaspoon salt. Place shrimp (peeled and deveined) into the mixture. Cover and marinate in the refrigerator at least 20 minutes."
      },
      {
        "text": "Heat 2 quarts oil in deep-fryer or large wok to 375 degrees F (190 degrees C)."
      },
      {
        "text": "In a medium bowl, mix together all-purpose flour, ice water, cornstarch, egg yolk, 1/4 teaspoon salt, white sugar, shortening and baking powder."
      },
      {
        "text": "One at a time, dip shrimp into the flour mixture to coat. Carefully place a few shrimp at a time in the hot oil. Deep fry until golden brown on all sides, about 1 1/2 minutes. Use a slotted spoon to remove from oil. Drain on paper towels. Serve warm.\r\n\r\nNOTE: Based on approximately 32 shrimp per 1/2 lb and approximately 1/2 teaspoon oil retention per shrimp, 5 tablespoons oil used in nutritional analysis for oil from fr"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Stuffed Cabbage",
      "difficulty": 3,
      "duration": "1 Hr 30 Min",
      "numPlates": "8 to 10"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 15% Fat-Bkd"
      },
      {
        "name": "Ground Pork-Ckd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Medium Grain Brown Rice-Ckd"
      },
      {
        "name": "Garlic Salt MCC"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Cmrcl Tomato Soup Cond-10.75oz Can"
      },
      {
        "name": "Sauerkraut Canned-w/Liquid"
      },
      {
        "name": "Diced Tomatoes-Cnd DLM"
      },
      {
        "name": "Cabbage Head Lrg 7\" Ckd-Drnd"
      },
      {
        "name": "Cured Bacon-Bkd"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C). Bring a pot of water to a boil."
      },
      {
        "text": "Mix 1 lb raw beef and pork together. Stir in chopped onion, cooked rice, parsley, salt, pepper, garlic salt and 1/2 can of tomato soup. Mix well."
      },
      {
        "text": "Core head of cabbage, place in boiling water and boil until partly cooked. Separate leaves and trim stems. Reserve about 24 to 32 whole leaves. Cut remaining leaves and line the bottom of large roasting pan."
      },
      {
        "text": "Lightly pack a small handful of the meat mixture and place in the center of a cabbage leaf. Fold top part of leaf over mixture, then fold in the sides and roll until mixture is completely encased. Lay rolls on top of torn cabbage leaves in pan. Place drained sauerkraut evenly over rolls. Lay bacon on top of sauerkraut. Sprinkle with 1 to 2 tablespoons of sugar. Mix chopped tomatoes and remaining soup with water and pour over rolls. Add additional water to reach top of cabbage rolls."
      },
      {
        "text": "Bake at 350 degrees F (175 degrees C) for 1 1/2 hours or until cooked through"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Spanakopita",
      "difficulty": 3,
      "duration": "40 Min",
      "numPlates": "10"
    },
    "ingredients": [
      {
        "name": "Spinach Fzn-10oz Pkg"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Feta Cheese-Crumbled"
      },
      {
        "name": "Swiss Cheese-Shredded"
      },
      {
        "name": "Parmesan Cheese-Grated"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "Phyllo Dough Pastry Crust-1 Sheet"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 375 degrees F (190 degrees C)."
      },
      {
        "text": "Place spinach (thawed and drained) in a steamer over 1 inch boiling water, and cook. Cook until tender, about 2 to 6 minutes. Drain and press to remove all water. Meanwhile, heat oil in a large skillet over medium heat. Saute the finely chopped onion until tender, but do not brown. Stir in cooked spinach and continue cooking until all moisture has evaporated. Remove from heat and cool to room temperature."
      },
      {
        "text": "In a large bowl combine feta cheese, Swiss cheese, Parmesan cheese, beaten eggs, parsley and cinnamon. Stir in spinach and onion mixture."
      },
      {
        "text": "Brush the bottom of a 17x11 inch jelly roll pan with melted butter. Place 1 sheet of dough in the bottom of the pan; brush with butter. Continue to layer 13 more sheets of dough, brushing every other sheet with butter. Spread spinach and cheese mixture over dough. Continue layering with remaining dough, brushing every other sheet with butter. Tuck edges of dough under. Brush top sheet with butter and, using a sharp knife, score top layer into diamonds."
      },
      {
        "text": "Bake in preheated oven for 40 minutes, or until golden brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Rice Bake",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 10%Fat-Pan Browned"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Crushed Tomatoes-Cnd"
      },
      {
        "name": "Water"
      },
      {
        "name": "Enrich Long Grain White Rice-Dry"
      },
      {
        "name": "Chili Sauce DLM"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Ground Cumin Seed AST"
      },
      {
        "name": "Worcestershire Sauce"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Cheddar Cheese-Shredded"
      },
      {
        "name": "Fresh Cilantro-Leaves"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 375 degrees F (190 degrees C)."
      },
      {
        "text": "Brown 1 lb raw ground beef in a large skillet over medium -high heat. Drain excess fat and transfer beef to a large pot over medium low heat. Stir in chopped onion, chopped green bell pepper, tomatoes, water, rice, chile sauce, salt, brown sugar, cumin, Worcestershire sauce and ground black pepper."
      },
      {
        "text": "Let this simmer for about 30 minutes, stirring occasionally, then transfer to a 2-quart casserole dish. Press down firmly and sprinkle with shredded Cheddar cheese."
      },
      {
        "text": "Bake at 375 degrees F (190 degrees C) for 10 to 15 minutes, or until cheese is melted and bubbly. Garnish with chopped fresh cilantro"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Stovies",
      "difficulty": 3,
      "duration": "30 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Peeled Potato Cooked-3\" to 4.25\""
      },
      {
        "name": "3.25% Whole Milk"
      },
      {
        "name": "Salted Butter"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Cured Corned Beef Slices-Cnd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      }
    ],
    "steps": [
      {
        "text": "In a saucepan, combine potatoes (peeled and cubed) and milk. Bring to a boil, reduce heat, and simmer until potatoes are tender, about 30 minutes."
      },
      {
        "text": "While potatotes are simmering, melt butter in a skillet over medium high heat. Saute roughly chopped onions until soft and translucent."
      },
      {
        "text": "When potatoes are soft, mix in sauteed onions and corned beef (cut into chunks). Cook an additional 10 minutes, or until heated through. Season with salt and pepper to taste"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Canola Oil"
      },
      {
        "name": "Beef Top Sirloin Stk All 1/8\"Trim-Brld"
      },
      {
        "name": "Tamari Soy Sauce"
      },
      {
        "name": "MSG Flavor Enhancer TKI"
      },
      {
        "name": "Chicken Broth-rts Can"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      },
      {
        "name": "Diced Celery Cooked-Drnd"
      },
      {
        "name": "Bamboo Shoots Slices Canned-Drnd"
      },
      {
        "name": "Fresh Green Onions Bulb & Tops-Med"
      },
      {
        "name": "Mushroom Drained-Can"
      },
      {
        "name": "Chinese Waterchestnuts Whole w/Liq-Cnd"
      },
      {
        "name": "Corn Starch"
      }
    ],
    "steps": [
      {
        "text": "Heat oil in a large skillet or wok over medium-high heat. Brown beef in hot oil, then stir in soy sauce, MSG, broth, and sugar. Mix in sliced onions and chopped celery, and cook until tender. Stir in drained and chopped bamboo shoots, sliced green onions, drained mushrooms, and drained water chestnuts. Reduce heat to medium, stir in cornstarch, and simmer until sauce is thicken"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Chicken",
      "difficulty": 3,
      "duration": "20 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Pineapple Chunks w/Juice-Cnd"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Chopped Celery-Steamed"
      },
      {
        "name": "Chinese Waterchestnut Slices w/Liq-Cnd"
      },
      {
        "name": "Chicken Broil/Fry Whl w/oSkin Chpd-Rstd"
      }
    ],
    "steps": [
      {
        "text": "In a large saucepan over medium-high heat, blend reserved pineapple juice, soy sauce, vinegar, and brown sugar. Mix in flour, and stir until thickened."
      },
      {
        "text": "Stir in 1-1/2 diced bell peppers, chopped celery, and drained and sliced water chestnuts into the saucepan. Mix in cooked chicken (cut into strips). Cook and stir until heated through. Stir in the pineapple chunks before serving"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Patties",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Pork Tenderloin Lean-Rstd"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Baking Soda"
      },
      {
        "name": "Water"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Bitter Cassava Flour/Meal INTL"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Fresh Hot Red Chili Peppers"
      },
      {
        "name": "Crushed Pineapple w/Juice-Cnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Distilled Vinegar"
      },
      {
        "name": "Ketchup"
      },
      {
        "name": "Plum Sauce-rts"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Arrange pork medallions on a cutting board and cover with a sheet of plastic wrap. Using a mallet or the back of a knife, pound the pork until each medallion is fairly flat, about 1/4 inch thick."
      },
      {
        "text": "Cut each medallion into 1 inch square pieces. In a medium bowl, combine the salt, baking soda and 1 tablespoon water. Place the pork pieces in the bowl and turn to coat."
      },
      {
        "text": "Place 1/4 cup cassava flour (tapioca flour) in a large, resealable plastic bag. Place the pork pieces in the bag with the flour and shake the meat around until all the pieces are coated with the flour."
      },
      {
        "text": "Heat the oil in a large skillet over medium high heat. Place the pork pieces in the oil and fry for 5 to 10 minutes, or until golden brown. Remove the pork from the oil and set aside."
      },
      {
        "text": "In the same skillet over medium high heat, combine one chopped green bell pepper, chopped red chile pepper (optional), pineapple, chopped onion, and chopped tomato and saute for 5 minutes."
      },
      {
        "text": "To Make Gravy: In a separate small bowl, combine the white sugar, salt, cornstarch, vinegar, ketchup, plum sauce and 5 tablespoons water. Mix well and pour this into the skillet with the vegetables."
      },
      {
        "text": "Reduce heat to low and let simmer for 5 to 10 minutes, allowing the gravy to thicken. Return the pork pieces to the skillet, mix all together well and serve"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Sausage",
      "difficulty": 3,
      "duration": "1 Hr",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Smoked Turky&Beef Polish KielbasaSausage"
      },
      {
        "name": "Worcestershire Sauce"
      },
      {
        "name": "Fresh Lemon Juice"
      },
      {
        "name": "White Onion Cooked Drained Whole-Med"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Hot/Pepper Sauce-rts"
      },
      {
        "name": "Water"
      }
    ],
    "steps": [
      {
        "text": "Place sausage (cut into 1 inch pieces) in a large saucepan. Add water to cover and simmer over low heat for 1 hour. Drain, remove sausage and set aside."
      },
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "In the same saucepan combine the Worcestershire sauce, lemon juice, chopped onion, sugar, hot pepper sauce and water. Bring all to a boil, stirring. Place reserved sausage in a 9x13 inch baking dish and cover it with the sauce mixture."
      },
      {
        "text": "Bake at 350 degrees F (175 degrees c) for 1 hour"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Beef",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Beef Top Sirloin All Lean 1/8\"Trim-Brld"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Corn Starch"
      },
      {
        "name": "Crushed Red Chili Pepper Flakes"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Broccoli Chopped Cooked-Drnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      },
      {
        "name": "Chinese Waterchestnuts Whole w/Liq-Cnd"
      },
      {
        "name": "Chicken Broth-rts Can CAM-HR"
      },
      {
        "name": "Dry Roasted Peanuts-Unsalted"
      }
    ],
    "steps": [
      {
        "text": "Toss beef (cut into bite size strips) with soy sauce, cornstarch, crushed red pepper, and minced garlic in non-metal bowl. Cover the refrigerate 20 minutes."
      },
      {
        "text": "Heat oil in wok or large skillet over high heat. Stir fry beef until no longer pink, 5 minutes. Stir in broccoli, wedged onions, and drained water chestnuts; cook 2 minutes. Pour in broth, and bring to a boil. Stir in peanuts, cook one minute more, and serve"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Satay",
      "difficulty": 3,
      "duration": "10 min",
      "numPlates": "4"
    },
    "ingredients": [
      {
        "name": "Chunky Peanut Butter"
      },
      {
        "name": "Fresh Green Onions Bulbs & Tops-Chpd"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Fresh Lemon Juice"
      },
      {
        "name": "Brown Sugar-Packed"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Ground Coriander AST"
      },
      {
        "name": "Dried Ground Cayenne Pepper"
      },
      {
        "name": "Pork Tenderloin-Rstd"
      },
      {
        "name": "Chinese Waterchestnuts Whole w/Liq-Cnd"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Sweet Red Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      }
    ],
    "steps": [
      {
        "text": "In a medium bowl, mix peanut butter, finely chopped green onions, soy sauce, lemon juice, brown sugar, minced garlic, coriander, and cayenne pepper; add pork (cubed), and stir to coat. Cover, and marinate in the refrigerator at least 30 minutes."
      },
      {
        "text": "Preheat grill for high heat. Thread marinated pork, water chestnuts, one green bell pepper (cut into 2 inch pieces), one ed bell pepper (cut into 2 inch pieces), and chopped sweet onion alternately onto skewers. Transfer remaining marinade to a small saucepan, bring to a boil, and cook for several minutes."
      },
      {
        "text": "Lightly oil grate. Cook skewers for 10 minutes, or to desired doneness. Turn skewers while grilling to cook evenly, and brush with boiled marinade during last few minutes"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Meat Pie",
      "difficulty": 3,
      "duration": "45 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Beef Ground Hamburger 10% Fat-Bkd"
      },
      {
        "name": "Ground Pork-Ckd"
      },
      {
        "name": "White Onion Cooked Drained Whole-Sml"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "Celery Stalk Cooked-Drnd"
      },
      {
        "name": "Whole Carrots Cooked-Drnd"
      },
      {
        "name": "Dehyd Chicken Broth-Cube"
      },
      {
        "name": "Peeled Potato Cooked-2.25\" to 3.25\""
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Ground Cinnamon"
      },
      {
        "name": "Ground Cloves"
      },
      {
        "name": "Ground Nutmeg"
      },
      {
        "name": "Single Pie Crust Prep f/Rec Unbkd-9\""
      },
      {
        "name": "Egg Yolks Raw-Lrg"
      },
      {
        "name": "Municipal Tap Water"
      }
    ],
    "steps": [
      {
        "text": "Brown 1/2 lb raw beef and pork with finely chopped onion and minced garlic in a large skillet. Drain and stir in 3/4 cup water, finely chopped celery, finely chopped carrot, bouillon and 1 bay leaf. Simmer for 10 minutes over medium heat; remove from heat and discard bay leaf."
      },
      {
        "text": "Preheat oven to 350 degrees F (175 degrees C)."
      },
      {
        "text": "Stir finely chopped potato, pepper, cinnamon, cloves and nutmeg into skillet mixture, then spoon mixture into pie shell. In a small bowl, combine egg yolk and 1 tablespoon water to make egg wash; brush edge of crust with wash, then carefully add top crust and seal edges. Make several slits in top crust; brush with remaining egg mixture."
      },
      {
        "text": "Bake in preheated over for 45 minutes, or until golden brown"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Lancashire Hot Pot",
      "difficulty": 3,
      "duration": "2 Hrs",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Cured Bacon-Pan Fried"
      },
      {
        "name": "Baked Potato w/Skin Unsalted-Med"
      },
      {
        "name": "WhiteOnion Cooked Drained Whole-Lrg"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Lamb Composite Choice Lean 1/4\" Trim-Ckd"
      },
      {
        "name": "Beef Gravy-Prep f/Recipe SVY"
      }
    ],
    "steps": [
      {
        "text": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside. Place thinly sliced potatoes in saucepan with one inch of water. Bring to a boil over medium-high heat, and cook until tender but not mushy, about 5 minutes. Drain and set aside to cool."
      },
      {
        "text": "Preheat the oven to 350 degrees F (175 degrees C). Cover the bottom of a 1 1/2 quart casserole dish with 1/2 cup gravy. Layer half of the meat over the gravy, then spinkle half of the crumbled bacon. Arrange 1/2 of the sliced onion over the meat, and then half of the potatoes. Repeat layers, and pour remaining gravy over the top."
      },
      {
        "text": "Bake, covered, for one hour in the preheated oven. Remove lid, and bake for an additional 15 minutes, or until potatoes are browned"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Vegetarian Lo Mein",
      "difficulty": 3,
      "duration": "10 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Chow Mein Noodles-Dry"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Mushroom Pieces Cooked-Drnd"
      },
      {
        "name": "Bamboo Shoots Canned-Svg CON-HL"
      },
      {
        "name": "Diced Celery Cooked-Drnd"
      },
      {
        "name": "Steamed Mature Soybean Sprouts"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Vegetable Broth-Cnd CAM-SW"
      },
      {
        "name": "White Granulated Sugar"
      },
      {
        "name": "Water"
      },
      {
        "name": "Soy Sauce-f/Soy"
      },
      {
        "name": "Oyster Sauce-rts"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      }
    ],
    "steps": [
      {
        "text": "Bring a large pot of lightly salted water to a boil. Add Chinese (chow mein or lo mein) noodles and cook about 2 to 4 minutes; drain."
      },
      {
        "text": "In a large skillet or wok over high heat with a small amount of oil; cook mushrooms, bamboo shoots, celery, bean sprouts and chopped garlic. Mix in salt, broth, sugar, water, soy sauce and oyster sauce; stir. Add flour and cook until thickened. Pour over noodles and toss lightly"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Wiener Schnitzel",
      "difficulty": 3,
      "duration": "15 Min",
      "numPlates": "8"
    },
    "ingredients": [
      {
        "name": "Veal Composite Lean-Ckd"
      },
      {
        "name": "Enrich All Purpose Bleached White Flour"
      },
      {
        "name": "Whole Eggs Raw-Lrg"
      },
      {
        "name": "Canola Oil"
      },
      {
        "name": "Table Salt"
      },
      {
        "name": "Black Pepper"
      },
      {
        "name": "Dry Bread Crumbs"
      },
      {
        "name": "Canola Oil"
      }
    ],
    "steps": [
      {
        "text": "Cut the veal into steaks, about as thick as your finger. Dredge in flour. In a shallow dish, beat the eggs with 1 tablespoon oil, salt and pepper to taste. Coat the veal with egg mixture, then with bread crumbs."
      },
      {
        "text": "Heat 1/4 cup oil in a heavy skillet over medium heat.\r\nFry veal until golden brown, about 5 minutes on each side"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Zuppa Toscana",
      "difficulty": 3,
      "duration": "55 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Smoked Pork Sausage Link-4\" x 1 1/8\""
      },
      {
        "name": "Peeled Potato Cooked-1.75\" to 2.5\""
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Cured Bacon-Pan Fried"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Fresh Kale Cabbage Cooked-Drnd"
      },
      {
        "name": "Dehyd Chicken Bouillon"
      },
      {
        "name": "Municipal Tap Water"
      },
      {
        "name": "Heavy Whipping Cream"
      }
    ],
    "steps": [
      {
        "text": "Preheat oven to 300 degrees F (150 degrees C)."
      },
      {
        "text": "Layer the sausage links onto a baking sheet and bake for 25 minutes, or until done. Cut in half length-wise, then cut at an angle into 1/2 inch slices."
      },
      {
        "text": "Place onions and bacon in a large saucepan and cook over medium heat until onions are almost clear."
      },
      {
        "text": "Remove bacon and crumble. Set aside."
      },
      {
        "text": "Add garlic to the onions and cook an additional 1 minute. Add chicken base or bouillon, water, and potatoes (cut into 1/4 inch slices), simmer 15 minutes."
      },
      {
        "text": "Add crumbled bacon, sausage, shredded kale, and cream. Simmer 4 minutes and serve"
      }
    ]
  },
  {
    "basicInfo": {
      "name": "Sausage Tortellini",
      "difficulty": 3,
      "duration": "55 Min",
      "numPlates": "6"
    },
    "ingredients": [
      {
        "name": "Italian Sweet Sausage Link"
      },
      {
        "name": "White Onions Chopped Cooked-Drnd"
      },
      {
        "name": "Fresh Garlic Cloves"
      },
      {
        "name": "Beef Stock"
      },
      {
        "name": "Water"
      },
      {
        "name": "Red Wine"
      },
      {
        "name": "Fresh Red Tomatoes YearRndAvg Med-2 3/5\""
      },
      {
        "name": "Carrot Slices Cooked-Drnd"
      },
      {
        "name": "Ground Basil"
      },
      {
        "name": "Oregano-Ground"
      },
      {
        "name": "Tomato Sauce-Cnd"
      },
      {
        "name": "Zucchini Squash Slices w/Skin Ckd-Drnd"
      },
      {
        "name": "Cheese Tortellini"
      },
      {
        "name": "Sweet Green Bell Peppers Chpd Ckd-Drnd"
      },
      {
        "name": "Fresh Parsley-Chpd"
      },
      {
        "name": "Parmesan Cheese-Grated"
      }
    ],
    "steps": [
      {
        "text": "Place the sausage (casings removed) in a large pot over medium high heat and saute for 10 minutes, or until well browned. Drain the fat except for about 1 tablespoon, add the onions and minced garlic and saute for 5 more minutes."
      },
      {
        "text": "Next add the beef stock, water, wine, tomatoes (peeled, seeded and chopped), chopped carrots, basil, oregano and tomato sauce. Bring to a boil, reduce heat to low and simmer for 30 minutes, skimming any fat that may surface."
      },
      {
        "text": "Add one chopped zucchini, tortellini, one chopped green bell pepper and parsley to taste. Simmer for 10 minutes, or until tortellini is fully cooked. Pour into individual bowls and granish with the cheese"
      }
    ]
  }
]